RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>RSQ1</name>
                    <displayName>RSQ1</displayName>
                    <description>Regular sequence register 1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP14</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ14</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP13</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ13</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ2</name>
                    <displayName>RSQ2</displayName>
                    <description>Regular sequence register 2</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP12</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ12</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP11</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ11</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ3</name>
                    <displayName>RSQ3</displayName>
                    <description>Regular sequence register 3</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP10</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ10</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP9</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ9</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ4</name>
                    <displayName>RSQ4</displayName>
                    <description>Regular sequence register 4</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP8</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ8</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP7</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ7</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ5</name>
                    <displayName>RSQ5</displayName>
                    <description>Regular sequence register 5</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP6</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ6</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP5</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ5</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ6</name>
                    <displayName>RSQ6</displayName>
                    <description>Regular sequence register 6</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP4</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ4</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP3</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ3</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ7</name>
                    <displayName>RSQ7</displayName>
                    <description>Regular sequence register 7</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP2</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ2</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSMP1</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ1</name>
                            <description>refer to RSQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSQ8</name>
                    <displayName>RSQ8</displayName>
                    <description>Regular sequence register 8</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSMP0</name>
                            <description>Regular channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSQ0</name>
                            <description>The channel number (0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISQ0</name>
                    <displayName>ISQ0</displayName>
                    <description>Inserted sequence register 0</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IL</name>
                            <description>Inserted channel group length</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISMP3</name>
                            <description>Inserted channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISQ3</name>
                            <description>refer to ISQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISQ1</name>
                    <displayName>ISQ1</displayName>
                    <description>Inserted sequence register 1</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ISMP2</name>
                            <description>Inserted channel sample time</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISQ2</name>
                            <description>refer to ISQ0[4:0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISMP1</name>
                            <description>Inserted channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISQ1</name>
                            <description>refer to ISQ0[4:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISQ2</name>
                    <displayName>ISQ2</displayName>
                    <description>Inserted sequence register 2</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ISMP0</name>
                            <description>Inserted channel sample time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ISQ0</name>
                            <description>The channel number (0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA0</name>
                    <displayName>IDATA0</displayName>
                    <description>Inserted data registe 0</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATAn</name>
                            <description>Inserted number n conversion data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA1</name>
                    <displayName>IDATA1</displayName>
                    <description>Inserted data registe 1</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATAn</name>
                            <description>Inserted number n conversion data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA2</name>
                    <displayName>IDATA2</displayName>
                    <description>Inserted data registe 2</description>
                    <addressOffset>0x5c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATAn</name>
                            <description>Inserted number n conversion data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA3</name>
                    <displayName>IDATA3</displayName>
                    <description>Inserted data registe 3</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATAn</name>
                            <description>Inserted number n conversion data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDATA</name>
                    <displayName>RDATA</displayName>
                    <description>Regular data register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Regular channel data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
