RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>OVSCR</name>
                    <displayName>OVSCR</displayName>
                    <description>Oversample control register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVSR</name>
                            <description>Oversampling ratio</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOVS</name>
                            <description>Triggered Oversampling</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSS</name>
                            <description>Oversampling shift</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSEN</name>
                            <description>Oversampler Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WD1SR</name>
                    <displayName>WD1SR</displayName>
                    <description>Watchdog 1 Channel Selection Register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000000</resetValue>
                    <fields>
                        <field>
                            <name>AWD1CS</name>
                            <description>Analog watchdog 1 channel selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WD2SR</name>
                    <displayName>WD2SR</displayName>
                    <description>Watchdog 2 Channel Selection Register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000000</resetValue>
                    <fields>
                        <field>
                            <name>AWD2CS</name>
                            <description>Analog watchdog 2 channel selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDHT1</name>
                    <displayName>WDHT1</displayName>
                    <description>Watchdog high threshold register1</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00FFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WDHT1</name>
                            <description>Analog watchdog 1 high threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDLT1</name>
                    <displayName>WDLT1</displayName>
                    <description>Watchdog low threshold register1</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WDLT1</name>
                            <description>Analog watchdog 1 low threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDHT2</name>
                    <displayName>WDHT2</displayName>
                    <description>Watchdog high threshold register2</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00FFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WDHT2</name>
                            <description>Analog watchdog 2 high threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDLT2</name>
                    <displayName>WDLT2</displayName>
                    <description>Watchdog low threshold register2</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WDLT2</name>
                            <description>Analog watchdog 2 low threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIFCTL</name>
                    <displayName>DIFCTL</displayName>
                    <description>Differential mode control registe</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIFCTL</name>
                            <description>Differential mode for channel 21</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTAT</name>
                    <displayName>SSTAT</displayName>
                    <description>Summary status register</description>
                    <addressOffset>0x300</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADC2_ROVF</name>
                            <description>This bit is the mirror image of the ROVF bit of ADC2</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC2_STRC</name>
                            <description>This bit is the mirror image of the STRC bit of ADC2</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC2_STIC</name>
                            <description>This bit is the mirror image of the STIC bit of ADC2</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC2_WDE2</name>
                            <description>This bit is the mirror image of the WDE2 bit of ADC2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC2_WDE1</name>
                            <description>This bit is the mirror image of the WDE1 bit of ADC2</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC2_WDE0</name>
                            <description>This bit is the mirror image of the WDE0 bit of ADC2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC1_ROVF</name>
                            <description>This bit is the mirror image of the ROVF bit of ADC1</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC1_STRC</name>
                            <description>This bit is the mirror image of the STRC bit of ADC1</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC1_EOC</name>
                            <description>This bit is the mirror image of the EOC bit of ADC1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC1_WDE2</name>
                            <description>This bit is the mirror image of the WDE2 bit of ADC1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC1_WDE1</name>
                            <description>This bit is the mirror image of the WDE1 bit of ADC1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC1_WDE0</name>
                            <description>This bit is the mirror image of the WDE0 bit of ADC1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC0_ROVF</name>
                            <description>This bit is the mirror image of the ROVF bit of ADC0</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC0_STRC</name>
                            <description>This bit is the mirror image of the STRC bit of ADC0</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC0_EOC</name>
                            <description>This bit is the mirror image of the EOC bit of ADC0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC0_WDE2</name>
                            <description>This bit is the mirror image of the WDE2 bit of ADC0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC0_WDE1</name>
                            <description>This bit is the mirror image of the WDE1 bit of ADC0</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ADC0_WDE0</name>
                            <description>This bit is the mirror image of the WDE0 bit of ADC0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNCCTL</name>
                    <displayName>SYNCCTL</displayName>
                    <description>Sync control register</description>
                    <addressOffset>0x304</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADCCK</name>
                            <description>ADC clock prescaler</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCSCK</name>
                            <description>ADC sync clock mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCDMA</name>
                            <description>ADC sync DMA mode selection</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCDDM</name>
                            <description>ADC sync DMA disable mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCDLY</name>
                            <description>ADC sync delay</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCM</name>
                            <description>ADC sync mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNCDATA0</name>
                    <displayName>SYNCDATA0</displayName>
                    <description>Sync regular data register0</description>
                    <addressOffset>0x308</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCDATA1</name>
                            <description>Regular data1(slave adc regular data) in ADC sync mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SYNCDATA0</name>
                            <description>Regular data0 (master adc regular data) in ADC sync mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNCDATA1</name>
                    <displayName>SYNCDATA1</displayName>
                    <description>Sync regular data register 1</description>
                    <addressOffset>0x30C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCDATA</name>
                            <description>which is selected from the regular data(master/slave) of the ADCs in turn</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
