RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>OVSCR</name>
                    <displayName>OVSCR</displayName>
                    <description>Oversample control register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVSR</name>
                            <description>Oversampling ratio</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOVS</name>
                            <description>Triggered Oversampling</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSS</name>
                            <description>Oversampling shift</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSEN</name>
                            <description>Oversampler Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WD1SR</name>
                    <displayName>WD1SR</displayName>
                    <description>Watchdog 1 Channel Selection Register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000000</resetValue>
                    <fields>
                        <field>
                            <name>AWD1CS</name>
                            <description>Analog watchdog 1 channel selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WD2SR</name>
                    <displayName>WD2SR</displayName>
                    <description>Watchdog 2 Channel Selection Register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000000</resetValue>
                    <fields>
                        <field>
                            <name>AWD2CS</name>
                            <description>Analog watchdog 2 channel selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDHT1</name>
                    <displayName>WDHT1</displayName>
                    <description>Watchdog high threshold register1</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00FFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WDHT1</name>
                            <description>Analog watchdog 1 high threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDLT1</name>
                    <displayName>WDLT1</displayName>
                    <description>Watchdog low threshold register1</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WDLT1</name>
                            <description>Analog watchdog 1 low threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDHT2</name>
                    <displayName>WDHT2</displayName>
                    <description>Watchdog high threshold register2</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00FFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WDHT2</name>
                            <description>Analog watchdog 2 high threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDLT2</name>
                    <displayName>WDLT2</displayName>
                    <description>Watchdog low threshold register2</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WDLT2</name>
                            <description>Analog watchdog 2 low threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIFCTL</name>
                    <displayName>DIFCTL</displayName>
                    <description>Differential mode control registe</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIFCTL</name>
                            <description>Differential mode for channel 21</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYNCCTL</name>
                    <displayName>SYNCCTL</displayName>
                    <description>Sync control register</description>
                    <addressOffset>0x304</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADCCK</name>
                            <description>ADC clock prescaler</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCSCK</name>
                            <description>ADC sync clock mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
