RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>TIMERCISEL1</name>
                    <displayName>TIMERCISEL1</displayName>
                    <description>Timer input selection register 1</description>
                    <addressOffset>0x038</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER1_CI3_SEL</name>
                            <description>TIMER1_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1_CI2_SEL</name>
                            <description>TIMER1_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1_CI1_SEL</name>
                            <description>TIMER1_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1_CI0_SEL</name>
                            <description>TIMER1_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI3_SEL</name>
                            <description>TIMER2_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI2_SEL</name>
                            <description>TIMER2_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI1_SEL</name>
                            <description>TIMER2_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2_CI0_SEL</name>
                            <description>TIMER2_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL2</name>
                    <displayName>TIMERCISEL2</displayName>
                    <description>Timer input selection register 2</description>
                    <addressOffset>0x03C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER3_CI3_SEL</name>
                            <description>TIMER3_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3_CI2_SEL</name>
                            <description>TIMER3_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3_CI1_SEL</name>
                            <description>TIMER3_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3_CI0_SEL</name>
                            <description>TIMER3_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI3_SEL</name>
                            <description>TIMER4_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI2_SEL</name>
                            <description>TIMER4_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI1_SEL</name>
                            <description>TIMER4_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4_CI0_SEL</name>
                            <description>TIMER4_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL3</name>
                    <displayName>TIMERCISEL3</displayName>
                    <description>Timer input selection register 3</description>
                    <addressOffset>0x040</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER22_CI3_SEL</name>
                            <description>TIMER22_CI3 input selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22_CI2_SEL</name>
                            <description>TIMER22_CI2 input selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22_CI1_SEL</name>
                            <description>TIMER22_CI1 input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22_CI0_SEL</name>
                            <description>TIMER22_CI0 input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI3_SEL</name>
                            <description>TIMER23_CI3 input selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI2_SEL</name>
                            <description>TIMER23_CI2 input selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI1_SEL</name>
                            <description>TIMER23_CI1 input selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23_CI0_SEL</name>
                            <description>TIMER23_CI0 input selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL5</name>
                    <displayName>TIMERCISEL5</displayName>
                    <description>Timer input selection register 5</description>
                    <addressOffset>0x048</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER42_CI1_SEL</name>
                            <description>Selects TIMER42_CI1 input</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER42_CI0_SEL</name>
                            <description>Selects TIMER42_CI0 input</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER41_CI1_SEL</name>
                            <description>Selects TIMER41_CI1 input</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER41_CI0_SEL</name>
                            <description>Selects TIMER41_CI0 input</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER40_CI1_SEL</name>
                            <description>Selects TIMER40_CI1 input</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER40_CI0_SEL</name>
                            <description>Selects TIMER40_CI0 input</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER14_CI1_SEL</name>
                            <description>Selects TIMER14_CI1 input</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER14_CI0_SEL</name>
                            <description>Selects TIMER14_CI0 input</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMERCISEL6</name>
                    <displayName>TIMERCISEL6</displayName>
                    <description>Timer input selection register 6</description>
                    <addressOffset>0x04C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMER44_CI1_SEL</name>
                            <description>Selects TIMER44_CI1 input</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER44_CI0_SEL</name>
                            <description>Selects TIMER44_CI0 input</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER43_CI1_SEL</name>
                            <description>Selects TIMER43_CI1 input</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER43_CI0_SEL</name>
                            <description>Selects TIMER43_CI0 input</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER16_CI0_SEL</name>
                            <description>Selects TIMER16_CI0 input</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER15_CI0_SEL</name>
                            <description>Selects TIMER15_CI0 input</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPUICAC</name>
                    <displayName>CPUICAC</displayName>
                    <description>CPU ICACHE error status registe</description>
                    <addressOffset>0x054</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CPU_ICDET</name>
                            <description>The ICACHE error detection information</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CPU_ICERR</name>
                            <description>The ICACHE error bank information</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPUDCAC</name>
                    <displayName>CPUDCAC</displayName>
                    <description>CPU DCACHE error status register</description>
                    <addressOffset>0x058</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CPU_DCDET</name>
                            <description>The DCACHE error detection information</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CPU_DCERR</name>
                            <description>The DCACHE error bank information</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUINTEN</name>
                    <displayName>FPUINTEN</displayName>
                    <description>FPU interrupt enable register</description>
                    <addressOffset>0x05C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000001F</resetValue>
                    <fields>
                        <field>
                            <name>IXIE</name>
                            <description>Inexact interrupt enable bit</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDIE</name>
                            <description>Input denormal interrupt enable bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFIE</name>
                            <description>Overflow interrupt enable bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UFIE</name>
                            <description>Underflow interrupt enable bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DZIE</name>
                            <description>Divide by 0 interrupt enable bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IOPIZ</name>
                            <description>Invalid operation interrupt enable bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMCFG0</name>
                    <displayName>SRAMCFG0</displayName>
                    <description>SYSCFG SRAM configuration register 0</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SECURE_SRAM_SIZE</name>
                            <description>These bits indicate the size of secure sram</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMCFG1</name>
                    <displayName>SRAMCFG1</displayName>
                    <description>SYSCFG SRAM configuration register 1</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TCM_WAITSTATE</name>
                            <description>TCM wait state configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
