RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>TIMER0CFG0</name>
                    <displayName>TIMER0CFG0</displayName>
                    <description>TIMER0 configuration register 0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER1CFG0</name>
                    <displayName>TIMER1CFG0</displayName>
                    <description>TIMER1 configuration register 0</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER2CFG0</name>
                    <displayName>TIMER2CFG0</displayName>
                    <description>TIMER2 configuration register 0</description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER3CFG0</name>
                    <displayName>TIMER3CFG0</displayName>
                    <description>TIMER3 configuration register 0</description>
                    <addressOffset>0x124</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER4CFG0</name>
                    <displayName>TIMER4CFG0</displayName>
                    <description>TIMER4 configuration register 0</description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER7CFG0</name>
                    <displayName>TIMER7CFG0</displayName>
                    <description>TIMER7 configuration register 0</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER14CFG0</name>
                    <displayName>TIMER14CFG0</displayName>
                    <description>TIMER14 configuration register 0</description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER22CFG0</name>
                    <displayName>TIMER22CFG0</displayName>
                    <description>TIMER22 configuration register 0</description>
                    <addressOffset>0x154</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER23CFG0</name>
                    <displayName>TIMER23CFG0</displayName>
                    <description>TIMER23 configuration register 0</description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG5</name>
                            <description>Event mode configuration</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG4</name>
                            <description>Pause mode configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG3</name>
                            <description>Restart mode configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG2</name>
                            <description>Quadrature decoder mode 2 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG1</name>
                            <description>Quadrature decoder mode 1 configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG0</name>
                            <description>Quadrature decoder mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
