RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>TIMER7CFG1</name>
                    <displayName>TIMER7CFG1</displayName>
                    <description>TIMER7 configuration register 1</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER14CFG1</name>
                    <displayName>TIMER14CFG1</displayName>
                    <description>TIMER14 configuration register 1</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER22CFG1</name>
                    <displayName>TIMER22CFG1</displayName>
                    <description>TIMER22 configuration register 1</description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER23CFG1</name>
                    <displayName>TIMER23CFG1</displayName>
                    <description>TIMER23 configuration register 1</description>
                    <addressOffset>0x164</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER30CFG1</name>
                    <displayName>TIMER30CFG1</displayName>
                    <description>TIMER30 configuration register 1</description>
                    <addressOffset>0x170</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER31CFG1</name>
                    <displayName>TIMER31CFG1</displayName>
                    <description>TIMER31 configuration register 1</description>
                    <addressOffset>0x17C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG9</name>
                            <description>Non-quadrature decoder mode 1 configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG8</name>
                            <description>Non-quadrature decoder mode 0 configuration</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER40CFG1</name>
                    <displayName>TIMER40CFG1</displayName>
                    <description>TIMER40 configuration register 1</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER41CFG1</name>
                    <displayName>TIMER41CFG1</displayName>
                    <description>TIMER41 configuration register 1</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER42CFG1</name>
                    <displayName>TIMER42CFG1</displayName>
                    <description>TIMER42 configuration register 1</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER43CFG1</name>
                    <displayName>TIMER43CFG1</displayName>
                    <description>TIMER43 configuration register 1</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER44CFG1</name>
                    <displayName>TIMER44CFG1</displayName>
                    <description>TIMER44 configuration register 1</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG7</name>
                            <description>Restart or event mode configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSCFG6</name>
                            <description>External clock mode 0 configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER0CFG2</name>
                    <displayName>TIMER0CFG2</displayName>
                    <description>TIMER0 configuration register 2</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER1CFG2</name>
                    <displayName>TIMER1CFG2</displayName>
                    <description>TIMER1 configuration register 2</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER2CFG2</name>
                    <displayName>TIMER2CFG2</displayName>
                    <description>TIMER2 configuration register 2</description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER3CFG2</name>
                    <displayName>TIMER3CFG2</displayName>
                    <description>TIMER3 configuration register 2</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER4CFG2</name>
                    <displayName>TIMER4CFG2</displayName>
                    <description>TIMER4 configuration register 2</description>
                    <addressOffset>0x138</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER7CFG2</name>
                    <displayName>TIMER7CFG2</displayName>
                    <description>TIMER7 configuration register 2</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER14CFG2</name>
                    <displayName>TIMER14CFG2</displayName>
                    <description>TIMER14 configuration register 2</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER22CFG2</name>
                    <displayName>TIMER22CFG2</displayName>
                    <description>TIMER22 configuration register 2</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
