RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>TIMER23CFG2</name>
                    <displayName>TIMER23CFG2</displayName>
                    <description>TIMER23 configuration register 2</description>
                    <addressOffset>0x168</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER30CFG2</name>
                    <displayName>TIMER30CFG2</displayName>
                    <description>TIMER30 configuration register 2</description>
                    <addressOffset>0x174</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER31CFG2</name>
                    <displayName>TIMER31CFG2</displayName>
                    <description>TIMER31 configuration register 2</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER40CFG2</name>
                    <displayName>TIMER40CFG2</displayName>
                    <description>TIMER40 configuration register 2</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER41CFG2</name>
                    <displayName>TIMER41CFG2</displayName>
                    <description>TIMER41 configuration register 2</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER42CFG2</name>
                    <displayName>TIMER42CFG2</displayName>
                    <description>TIMER42 configuration register 2</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER43CFG2</name>
                    <displayName>TIMER43CFG2</displayName>
                    <description>TIMER43 configuration register 2</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER44CFG2</name>
                    <displayName>TIMER44CFG2</displayName>
                    <description>TIMER44 configuration register 2</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSCFG15</name>
                            <description>Internal trigger input source configuration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USERCFG0</name>
                    <displayName>USERCFG0</displayName>
                    <description>User configuration register 0</description>
                    <addressOffset>0x300</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BOOT_MODE</name>
                            <description>Boot mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BORLEV</name>
                            <description>BOR Brownout reset threshold level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
