RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>FDCTL</name>
                    <displayName>FDCTL</displayName>
                    <description>FD control register</description>
                    <addressOffset>0xC00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x80000101</resetValue>
                    <fields>
                        <field>
                            <name>BRSEN</name>
                            <description>Bit rate of data switch enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDSZ</name>
                            <description>Mailbox data size</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDCEN</name>
                            <description>Transmitter delay compensation enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDCS</name>
                            <description>Transmitter delay compensation status</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDCO</name>
                            <description>Transmitter delay compensation offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TDCV</name>
                            <description>Transmitter delay compensation value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FDBT</name>
                    <displayName>FDBT</displayName>
                    <description>FD bit timing register</description>
                    <addressOffset>0xC04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DBAUDPSC</name>
                            <description>Baud rate prescaler for data bit time</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSJW</name>
                            <description>Resynchronization jump width for data bit time</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPTS</name>
                            <description>Propagation time segment for data bit time</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPBS1</name>
                            <description>Phase buffer segment 1 for data bit time</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DPBS2</name>
                            <description>Phase buffer segment 2 for data bit time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCCFD</name>
                    <displayName>CRCCFD</displayName>
                    <description>CRC for classical and FD frame register</description>
                    <addressOffset>0xC08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ANTM</name>
                            <description>Associated number of mailbox for transmitting the CRCTCI[20:0] value</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRCTCI</name>
                            <description>Transmitted CRC value for classical and ISO / non-ISO FD frames</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>21</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
