RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="CAN0">
            <name>CAN1</name>
            <baseAddress>0x4001B000</baseAddress>
            <interrupt>
                <name>CAN1_WK</name>
                <value>186</value>
            </interrupt>
            <interrupt>
                <name>CAN1_BUFF</name>
                <value>187</value>
            </interrupt>
            <interrupt>
                <name>CAN1_BUSOFF</name>
                <value>188</value>
            </interrupt>
            <interrupt>
                <name>CAN1_ERROR</name>
                <value>189</value>
            </interrupt>
            <interrupt>
                <name>CAN1_ERROR_FTX</name>
                <value>190</value>
            </interrupt>
            <interrupt>
                <name>CAN1_WARNING_TX</name>
                <value>191</value>
            </interrupt>
            <interrupt>
                <name>CAN1_WARNING_RX</name>
                <value>192</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="CAN0">
            <name>CAN2</name>
            <baseAddress>0x4001C000</baseAddress>
            <interrupt>
                <name>CAN2_WK</name>
                <value>193</value>
            </interrupt>
            <interrupt>
                <name>CAN2_BUFF</name>
                <value>194</value>
            </interrupt>
            <interrupt>
                <name>CAN2_BUSOFF</name>
                <value>195</value>
            </interrupt>
            <interrupt>
                <name>CAN2_ERROR</name>
                <value>196</value>
            </interrupt>
            <interrupt>
                <name>CAN2_ERROR_FTX</name>
                <value>197</value>
            </interrupt>
            <interrupt>
                <name>CAN2_WARNING_TX</name>
                <value>198</value>
            </interrupt>
            <interrupt>
                <name>CAN2_WARNING_RX</name>
                <value>199</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>CMP</name>
            <description>Comparator</description>
            <groupName>CMP</groupName>
            <baseAddress>0x58003800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CPM_GLOBAL</name>
                <value>137</value>
            </interrupt>
            <registers>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMP1IF</name>
                            <description>CMP1 interrupt flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0IF</name>
                            <description>CMP0 interrupt flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1O</name>
                            <description>CMP1 output</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMP0O</name>
                            <description>CMP0 output</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFC</name>
                    <displayName>IFC</displayName>
                    <description>Interrupt flag clear register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMP1IC</name>
                            <description>CMP1 interrupt flag clear</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMP0IC</name>
                            <description>CMP0 interrupt flag clear</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>Alternate select register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AFSE</name>
                            <description>CMP alternate function of output ports select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMP0_CS</name>
                    <displayName>CMP0_CS</displayName>
                    <description>CMP0 Control/status register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMP0LK</name>
                            <description>CMP0 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0BLK</name>
                            <description>CMP0 output blanking source</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0PSEL</name>
                            <description>CMP0_IP input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0MSEL</name>
                            <description>CMP0_IM internal input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0M</name>
                            <description>CMP0 mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0HST</name>
                            <description>CMP0 hysteresis</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0INTEN</name>
                            <description>CMP0 interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0PL</name>
                            <description>Polarity of CMP0 output</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0SEN</name>
                            <description>Voltage scaler enable bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0BEN</name>
                            <description>Scaler bridge enable bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP0EN</name>
                            <description>CMP0 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMP1_CS</name>
                    <displayName>CMP1_CS</displayName>
                    <description>CMP1 Control/status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMP1LK</name>
                            <description>CMP1 lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1BLK</name>
                            <description>CMP1 output blanking source</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1PSEL</name>
                            <description>CMP1_IP input selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1MSEL</name>
                            <description>CMP1_IM internal input selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1M</name>
                            <description>CMP1 mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1HST</name>
                            <description>CMP1 hysteresis</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1INTEN</name>
                            <description>CMP1 interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WNDEN</name>
                            <description>Window mode enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1PL</name>
                            <description>Polarity of CMP1 output</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1SEN</name>
                            <description>Voltage scaler enable bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1BEN</name>
                            <description>Scaler bridge enable bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMP1EN</name>
                            <description>CMP1 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
