RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DAC</name>
            <description>Digital-to-analog converter</description>
            <groupName>DAC</groupName>
            <baseAddress>0x40007400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TIMER5_DAC</name>
                <value>54</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL0</name>
                    <displayName>CTL0</displayName>
                    <description>Control register 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALEN1</name>
                            <description>DAC_OUT1 calibration enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDUDRIE1</name>
                            <description>DAC_OUT1 DMA underrun interrupt enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDMAEN1</name>
                            <description>DAC_OUT1 DMA enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWBW1</name>
                            <description>DAC_OUT1 noise wave bit width</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWM1</name>
                            <description>DAC_OUT1 noise wave mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTSEL1</name>
                            <description>DAC_OUT1 trigger selection</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTEN1</name>
                            <description>DAC_OUT1 trigger enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN1</name>
                            <description>DAC_OUT1 enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALEN0</name>
                            <description>DAC_OUT0 calibration enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDUDRIE0</name>
                            <description>DAC_OUT0 DMA underrun interrupt enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DDMAEN0</name>
                            <description>DAC_OUT0 DMA enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWBW0</name>
                            <description>DAC_OUT0 noise wave bit width</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWM0</name>
                            <description>DAC_OUT0 noise wave mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTSEL0</name>
                            <description>DAC_OUT0 trigger selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTEN0</name>
                            <description>DAC_OUT0 trigger enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEN0</name>
                            <description>DAC_OUT0 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWT</name>
                    <displayName>SWT</displayName>
                    <description>Software trigger register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWTR1</name>
                            <description>DAC_OUT1 software trigger, cleared by hardware</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SWTR0</name>
                            <description>DAC_OUT0 software trigger, cleared by hardware</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT0_R12DH</name>
                    <displayName>OUT0_R12DH</displayName>
                    <description>DAC_OUT0 12-bit right-aligned data holding register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT0_DH</name>
                            <description>DAC_OUT0 12-bit right-aligned data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT0_L12DH</name>
                    <displayName>OUT0_L12DH</displayName>
                    <description>DAC_OUT0 12-bit left-aligned data holding register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT0_DH</name>
                            <description>DAC_OUT0 12-bit left-aligned data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT0_R8DH</name>
                    <displayName>OUT0_R8DH</displayName>
                    <description>DAC_OUT0 8-bit right-aligned data holding register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT0_DH</name>
                            <description>DAC_OUT0 8-bit right-aligned data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT1_R12DH</name>
                    <displayName>OUT1_R12DH</displayName>
                    <description>DAC_OUT1 12-bit right-aligned data holding register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DH</name>
                            <description>DAC_OUT1 12-bit right-aligned data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT1_L12DH</name>
                    <displayName>OUT1_L12DH</displayName>
                    <description>DAC_OUT1 12-bit left-aligned data holding register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DH</name>
                            <description>OUT1_DH[11:0]</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT1_R8DH</name>
                    <displayName>OUT1_R8DH</displayName>
                    <description>DAC_OUT1 8-bit right-aligned data holding register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DH</name>
                            <description>DAC_OUT1 8-bit right-aligned data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACC_R12DH</name>
                    <displayName>DACC_R12DH</displayName>
                    <description>DAC concurrent mode 12-bit right-aligned data holding register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DH</name>
                            <description>DAC_OUT1 12-bit right-aligned data</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUT0_DH</name>
                            <description>DAC_OUT0 12-bit right-aligned data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACC_L12DH</name>
                    <displayName>DACC_L12DH</displayName>
                    <description>DAC concurrent mode 12-bit left-aligned data holding register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DH</name>
                            <description>DAC_OUT1 12-bit left-aligned data</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUT0_DH</name>
                            <description>DAC_OUT0 12-bit left-aligned data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DACC_R8DH</name>
                    <displayName>DACC_R8DH</displayName>
                    <description>DAC concurrent mode 8-bit right-aligned data holding register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DH</name>
                            <description>DAC_OUT1 8-bit right-aligned data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUT0_DH</name>
                            <description>DAC_OUT0 8-bit right-aligned data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT0_DO</name>
                    <displayName>OUT0_DO</displayName>
                    <description>DAC_OUT0 data output register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT0_DO</name>
                            <description>DAC_OUT0 data output</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OUT1_DO</name>
                    <displayName>OUT1_DO</displayName>
                    <description>DAC_OUT1 data output register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OUT1_DO</name>
                            <description>DAC_OUT1 data output</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT0</name>
                    <displayName>STAT0</displayName>
                    <description>DAC Status register 0</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BWT1</name>
                            <description>This bit will be set after sample and keep mode enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CALF1</name>
                            <description>DAC_OUT1 calibration offset flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DDUDR1</name>
                            <description>DAC_OUT1 DMA underrun flag, set by hardware, cleared by software write 1</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BWT0</name>
                            <description>This bit will be set after sample and keep mode enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CALF0</name>
                            <description>DAC_OUT0 calibration offset flag</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DDUDR0</name>
                            <description>DAC_OUT0 DMA underrun flag, set by hardware, cleared by software write 1</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CALR</name>
                    <displayName>CALR</displayName>
                    <description>DAC calibration Register 1</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OTV1</name>
                            <description>DAC_OUT1 offset calibration value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OTV0</name>
                            <description>DAC_OUT0 offset calibration value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MDCR</name>
                    <displayName>MDCR</displayName>
                    <description>DAC mode control Register 1</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODE1</name>
                            <description>DAC OUT1 mode.</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE0</name>
                            <description>DAC OUT0 mode.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SKSTR0</name>
                    <displayName>SKSTR0</displayName>
                    <description>DAC sample and keep sample time Register 0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSAMP0</name>
                            <description>DAC_OUT0 sample time.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
