RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>SKSTR1</name>
                    <displayName>SKSTR1</displayName>
                    <description>DAC sample and keep sample time Register 1</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSAMP1</name>
                            <description>DAC_OUT refresh time (only valid in Sample and hold mode)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SKKTR</name>
                    <displayName>SKKTR</displayName>
                    <description>DAC sample and keep keep time Register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00010001</resetValue>
                    <fields>
                        <field>
                            <name>TKEEP1</name>
                            <description>DAC_OUT1 keep time</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TKEEP0</name>
                            <description>DAC_OUT0 keep time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SKRTR</name>
                    <displayName>SKRTR</displayName>
                    <description>DAC sample and keep refresh time Register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00010001</resetValue>
                    <fields>
                        <field>
                            <name>TREF1</name>
                            <description>DAC_OUT1 refresh time</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TREF0</name>
                            <description>DAC_OUT0 refresh time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DMA0</name>
            <description>Direct memory access controller</description>
            <groupName>DMA</groupName>
            <baseAddress>0x40020000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA0_Channel0</name>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel1</name>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel2</name>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel3</name>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel4</name>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel5</name>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel6</name>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>DMA0_Channel7</name>
                <value>47</value>
            </interrupt>
            <registers>
                <register>
                    <name>INTF0</name>
                    <displayName>INTF0</displayName>
                    <description>Interrupt flag register 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FTFIF3</name>
                            <description>Full Transfer finish flag of channel 3</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF3</name>
                            <description>Half transfer finish flag of channel 3</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF3</name>
                            <description>Transfer access error flag of channel 3</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF3</name>
                            <description>Single data mode exception of channel 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF3</name>
                            <description>FIFO error and exception of channel 3</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTFIF2</name>
                            <description>Full Transfer finish flag of channel 2</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF2</name>
                            <description>Half transfer finish flag of channel 2</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF2</name>
                            <description>Transfer access error flag of channel 2</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF2</name>
                            <description>Single data mode exception of channel 2</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF2</name>
                            <description>FIFO error and exception of channel 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTFIF1</name>
                            <description>Full Transfer finish flag of channel 1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF1</name>
                            <description>Half transfer finish flag of channel 1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF1</name>
                            <description>Transfer access error flag of channel 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF1</name>
                            <description>Single data mode exception of channel 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF1</name>
                            <description>FIFO error and exception of channel 1</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTFIF0</name>
                            <description>Full Transfer finish flag of channel 0</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF0</name>
                            <description>Half transfer finish flag of channel 0</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF0</name>
                            <description>Transfer access error flag of channel 0</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF0</name>
                            <description>Single data mode exception of channel 0</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF0</name>
                            <description>FIFO error and exception of channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTF1</name>
                    <displayName>INTF1</displayName>
                    <description>Interrupt flag register 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FTFIF7</name>
                            <description>Full Transfer finish flag of channel 7</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF7</name>
                            <description>Half transfer finish flag of channel 7</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF7</name>
                            <description>Transfer access error flag of channel 7</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF7</name>
                            <description>Single data mode exception of channel 7</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF7</name>
                            <description>FIFO error and exception of channel 7</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTFIF6</name>
                            <description>Full Transfer finish flag of channel 6</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF6</name>
                            <description>Half transfer finish flag of channel 6</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF6</name>
                            <description>Transfer access error flag of channel 6</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF6</name>
                            <description>Single data mode exception of channel 6</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF6</name>
                            <description>FIFO error and exception of channel 6</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTFIF5</name>
                            <description>Full Transfer finish flag of channel 5</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF5</name>
                            <description>Half transfer finish flag of channel 5</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF5</name>
                            <description>Transfer access error flag of channel 5</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF5</name>
                            <description>Single data mode exception of channel 5</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF5</name>
                            <description>FIFO error and exception of channel 5</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FTFIF4</name>
                            <description>Full Transfer finish flag of channel 4</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HTFIF4</name>
                            <description>Half transfer finish flag of channel 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TAEIF4</name>
                            <description>Transfer access error flag of channel 4</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDEIF4</name>
                            <description>Single data mode exception of channel 4</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FEEIF4</name>
                            <description>FIFO error and exception of channel 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
