RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>CH6FCTL</name>
                    <displayName>CH6FCTL</displayName>
                    <description>Channel 6 FIFO control regist</description>
                    <addressOffset>0xb4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FEEIE</name>
                            <description>Enable bit for FIFO error and exception interrupt</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCNT</name>
                            <description>FIFO counter</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDMEN</name>
                            <description>Multi-data mode enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCCV</name>
                            <description>FIFO counter critical value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7CTL</name>
                    <displayName>CH7CTL</displayName>
                    <description>Channel 7 control regist</description>
                    <addressOffset>0xb8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MBURST</name>
                            <description>Transfer burst type of memory</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBURST</name>
                            <description>Transfer burst type of peripheral</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBS</name>
                            <description>Memory buffer select</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBMEN</name>
                            <description>Switch-buffer mode enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIO</name>
                            <description>Priority level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAIF</name>
                            <description>Peripheral address increment fixed</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MWIDTH</name>
                            <description>Transfer width of memory</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWIDTH</name>
                            <description>Transfer width of peripheral</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MNAGA</name>
                            <description>Next address generation algorithm of memory</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PNAGA</name>
                            <description>Next address generation algorithm of peripheral</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEN</name>
                            <description>Circular mode enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TM</name>
                            <description>Transfer mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTFIE</name>
                            <description>Enable bit for full transfer finish interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HTFIE</name>
                            <description>Enable bit for half transfer finish interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TAEIE</name>
                            <description>Enable bit for tranfer access error interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDEIE</name>
                            <description>Enable bit for single data mode exception interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7CNT</name>
                    <displayName>CH7CNT</displayName>
                    <description>Channel 7 counter regist</description>
                    <addressOffset>0xbc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Transfer counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7PADDR</name>
                    <displayName>CH7PADDR</displayName>
                    <description>Channel 7 peripheral base address regist</description>
                    <addressOffset>0xc0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Peripheral base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7M0ADDR</name>
                    <displayName>CH7M0ADDR</displayName>
                    <description>Channel 7 memory 0 base address regist</description>
                    <addressOffset>0xc4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M0ADDR</name>
                            <description>Memory 0 base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7M1ADDR</name>
                    <displayName>CH7M1ADDR</displayName>
                    <description>Channel 7 memory 1 base address regist</description>
                    <addressOffset>0xc8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M1ADDR</name>
                            <description>Memory 1 base address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7FCTL</name>
                    <displayName>CH7FCTL</displayName>
                    <description>Channel 7 FIFO control regist</description>
                    <addressOffset>0xcc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FEEIE</name>
                            <description>Enable bit for FIFO error and exception interrupt</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCNT</name>
                            <description>FIFO counter</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDMEN</name>
                            <description>Multi-data mode enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FCCV</name>
                            <description>FIFO counter critical value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
