RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DMA0">
            <name>DMA1</name>
            <baseAddress>0x40020400</baseAddress>
            <interrupt>
                <name>DMA1_Channel0</name>
                <value>56</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel1</name>
                <value>57</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel2</name>
                <value>58</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel3</name>
                <value>59</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel4</name>
                <value>60</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel5</name>
                <value>68</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel6</name>
                <value>69</value>
            </interrupt>
            <interrupt>
                <name>DMA1_Channel7</name>
                <value>70</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>DMAMUX</name>
            <description>DMA request multiplexer</description>
            <groupName>DMAMUX</groupName>
            <baseAddress>0x40020800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMAMUX0</name>
                <value>102</value>
            </interrupt>
            <registers>
                <register>
                    <name>RM_CH0CFG</name>
                    <displayName>RM_CH0CFG</displayName>
                    <description>Request multiplexer channel 0 configuration regist</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH1CFG</name>
                    <displayName>RM_CH1CFG</displayName>
                    <description>Request multiplexer channel 1 configuration regist</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH2CFG</name>
                    <displayName>RM_CH2CFG</displayName>
                    <description>Request multiplexer channel 2 configuration regist</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH3CFG</name>
                    <displayName>RM_CH3CFG</displayName>
                    <description>Request multiplexer channel 3 configuration regist</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH4CFG</name>
                    <displayName>RM_CH4CFG</displayName>
                    <description>Request multiplexer channel 4 configuration regist</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH5CFG</name>
                    <displayName>RM_CH5CFG</displayName>
                    <description>Request multiplexer channel 5 configuration regist</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RM_CH6CFG</name>
                    <displayName>RM_CH6CFG</displayName>
                    <description>Request multiplexer channel 6 configuration regist</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SYNCID</name>
                            <description>Synchronization input identification</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NBR</name>
                            <description>Number of DMA requests to forward</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCP</name>
                            <description>Synchronization input polarity</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCEN</name>
                            <description>Synchronization enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EVGEN</name>
                            <description>Event generation enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOIE</name>
                            <description>Synchronization overrun interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUXID</name>
                            <description>Multiplexer input identification</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
