RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>FTEN0</name>
                    <displayName>FTEN0</displayName>
                    <description>
                        Falling Egde Trigger Enable register 0
                        (EXTI_FTEN0)
                    </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FTEN0</name>
                            <description>
                                Falling edge trigger enable of
                                line 0
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN1</name>
                            <description>
                                Falling edge trigger enable of
                                line 1
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN2</name>
                            <description>
                                Falling edge trigger enable of
                                line 2
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN3</name>
                            <description>
                                Falling edge trigger enable of
                                line 3
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN4</name>
                            <description>
                                Falling edge trigger enable of
                                line 4
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN5</name>
                            <description>
                                Falling edge trigger enable of
                                line 5
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN6</name>
                            <description>
                                Falling edge trigger enable of
                                line 6
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN7</name>
                            <description>
                                Falling edge trigger enable of
                                line 7
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN8</name>
                            <description>
                                Falling edge trigger enable of
                                line 8
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN9</name>
                            <description>
                                Falling edge trigger enable of
                                line 9
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN10</name>
                            <description>
                                Falling edge trigger enable of
                                line 10
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN11</name>
                            <description>
                                Falling edge trigger enable of
                                line 11
                            </description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN12</name>
                            <description>
                                Falling edge trigger enable of
                                line 12
                            </description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN13</name>
                            <description>
                                Falling edge trigger enable of
                                line 13
                            </description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN14</name>
                            <description>
                                Falling edge trigger enable of
                                line 14
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN15</name>
                            <description>
                                Falling edge trigger enable of
                                line 15
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN16</name>
                            <description>
                                Falling edge trigger enable of
                                line 16
                            </description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN17</name>
                            <description>
                                Falling edge trigger enable of
                                line 17
                            </description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN18</name>
                            <description>
                                Falling edge trigger enable of
                                line 18
                            </description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN19</name>
                            <description>
                                Falling edge trigger enable of
                                line 19
                            </description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN20</name>
                            <description>
                                Falling edge trigger enable of
                                line 20
                            </description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN21</name>
                            <description>
                                Falling edge trigger enable of
                                line 21
                            </description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN22</name>
                            <description>
                                Falling edge trigger enable of
                                line 22
                            </description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN23</name>
                            <description>
                                Falling edge trigger enable of
                                line 23
                            </description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN24</name>
                            <description>
                                Falling edge trigger enable of
                                line 24
                            </description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN25</name>
                            <description>
                                Falling edge trigger enable of
                                line 25
                            </description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN26</name>
                            <description>
                                Falling edge trigger enable of
                                line 26
                            </description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN27</name>
                            <description>
                                Falling edge trigger enable of
                                line 27
                            </description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN28</name>
                            <description>
                                Falling edge trigger enable of
                                line 28
                            </description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN29</name>
                            <description>
                                Falling edge trigger enable of
                                line 29
                            </description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN30</name>
                            <description>
                                Falling edge trigger enable of
                                line 30
                            </description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN31</name>
                            <description>
                                Falling edge trigger enable of
                                line 31
                            </description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
