RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>INTEN1</name>
                    <displayName>INTEN1</displayName>
                    <description>
                        Interrupt enable register 0
                        (EXTI_INTEN1)
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEN32</name>
                            <description>Enable Interrupt on line 32</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN33</name>
                            <description>Enable Interrupt on line 33</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN34</name>
                            <description>Enable Interrupt on line 34</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN35</name>
                            <description>Enable Interrupt on line 35</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN36</name>
                            <description>Enable Interrupt on line 36</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN37</name>
                            <description>Enable Interrupt on line 37</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EVEN1</name>
                    <displayName>EVEN1</displayName>
                    <description>Event enable register  1 (EXTI_EVEN1)</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EVEN32</name>
                            <description>Enable Event on line 32</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN33</name>
                            <description>Enable Event on line 33</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN34</name>
                            <description>Enable Event on line 34</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN35</name>
                            <description>Enable Event on line 35</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN36</name>
                            <description>Enable Event on line 36</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN37</name>
                            <description>Enable Event on line 37</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTEN1</name>
                    <displayName>RTEN1</displayName>
                    <description>
                        Rising Edge Trigger Enable register 1
                        (EXTI_RTEN1)
                    </description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTEN32</name>
                            <description>
                                Rising edge trigger enable of
                                line 32
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN33</name>
                            <description>
                                Rising edge trigger enable of
                                line 33
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN34</name>
                            <description>
                                Rising edge trigger enable of
                                line 34
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN35</name>
                            <description>
                                Rising edge trigger enable of
                                line 35
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN36</name>
                            <description>
                                Rising edge trigger enable of
                                line 36
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN37</name>
                            <description>
                                Rising edge trigger enable of
                                line 37
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FTEN1</name>
                    <displayName>FTEN1</displayName>
                    <description>
                        Falling Egde Trigger Enable register 1
                        (EXTI_FTEN1)
                    </description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FTEN32</name>
                            <description>
                                Falling edge trigger enable of
                                line 32
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN33</name>
                            <description>
                                Falling edge trigger enable of
                                line 33
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN34</name>
                            <description>
                                Falling edge trigger enable of
                                line 34
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN35</name>
                            <description>
                                Falling edge trigger enable of
                                line 35
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN36</name>
                            <description>
                                Falling edge trigger enable of
                                line 36
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FTEN37</name>
                            <description>
                                Falling edge trigger enable of
                                line 37
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWIEV1</name>
                    <displayName>SWIEV1</displayName>
                    <description>
                        Software interrupt event register
                        (EXTI_SWIEV1)
                    </description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWIEV32</name>
                            <description>
                                Interrupt/Event software trigger on line
                                32
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV33</name>
                            <description>
                                Interrupt/Event software trigger on line
                                33
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV34</name>
                            <description>
                                Interrupt/Event software trigger on line
                                34
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV35</name>
                            <description>
                                Interrupt/Event software trigger on line
                                35
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV36</name>
                            <description>
                                Interrupt/Event software trigger on line
                                36
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWIEV37</name>
                            <description>
                                Interrupt/Event software trigger on line
                                37
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PD1</name>
                    <displayName>PD1</displayName>
                    <description>Pending register (EXTI_PD1)</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PD32</name>
                            <description>Interrupt pending status of line 32</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD33</name>
                            <description>Interrupt pending status of line 33</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD34</name>
                            <description>Interrupt pending status of line 34</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD35</name>
                            <description>Interrupt pending status of line 35</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD36</name>
                            <description>Interrupt pending status of line 36</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PD37</name>
                            <description>Interrupt pending status of line 37</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
