RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>SNCTL3</name>
                    <displayName>SNCTL3</displayName>
                    <description>SRAM/NOR flash control registe 3</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000030DA</resetValue>
                    <fields>
                        <field>
                            <name>BKREMAP</name>
                            <description>Bank remap</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CCK</name>
                            <description>Consecutive Clock</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYNCWR</name>
                            <description>Synchronous write</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CPS</name>
                            <description>CRAM page size</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ASYNCWAIT</name>
                            <description>Asynchronous wait</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXMODEN</name>
                            <description>Extended mode enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRWTEN</name>
                            <description>NWAIT signal enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WREN</name>
                            <description>Write enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRWTCFG</name>
                            <description>NWAIT signal configuration, only work in synchronous mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRWTPOL</name>
                            <description>NWAIT signal polarity</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBRSTEN</name>
                            <description>Synchronous burst enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NREN</name>
                            <description>NOR Flash access enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRW</name>
                            <description>NOR region memory data bus width</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRTP</name>
                            <description>NOR region memory type</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRMUX</name>
                            <description>NOR region memory address/data multiplexing</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NRBKEN</name>
                            <description>NOR region enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNTCFG0</name>
                    <displayName>SNTCFG0</displayName>
                    <description>SRAM/NOR flash timing configuration registe 0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCMOD</name>
                            <description>Asynchronous access mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLAT</name>
                            <description>Data latency for NOR Flash</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>Synchronous clock divide ratio</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSLAT</name>
                            <description>Bus latency</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSET</name>
                            <description>Data setup time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHLD</name>
                            <description>Address hold time</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ASET</name>
                            <description>Address setup time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNTCFG1</name>
                    <displayName>SNTCFG1</displayName>
                    <description>SRAM/NOR flash timing configuration registe 1</description>
                    <addressOffset>0xc</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCMOD</name>
                            <description>Asynchronous access mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLAT</name>
                            <description>Data latency for NOR Flash</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>Synchronous clock divide ratio</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSLAT</name>
                            <description>Bus latency</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSET</name>
                            <description>Data setup time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHLD</name>
                            <description>Address hold time</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ASET</name>
                            <description>Address setup time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNTCFG2</name>
                    <displayName>SNTCFG2</displayName>
                    <description>SRAM/NOR flash timing configuration registe 2</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCMOD</name>
                            <description>Asynchronous access mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLAT</name>
                            <description>Data latency for NOR Flash</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>Synchronous clock divide ratio</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSLAT</name>
                            <description>Bus latency</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSET</name>
                            <description>Data setup time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHLD</name>
                            <description>Address hold time</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ASET</name>
                            <description>Address setup time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNTCFG3</name>
                    <displayName>SNTCFG3</displayName>
                    <description>SRAM/NOR flash timing configuration registe 3</description>
                    <addressOffset>0x1c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCMOD</name>
                            <description>Asynchronous access mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLAT</name>
                            <description>Data latency for NOR Flash</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKDIV</name>
                            <description>Synchronous clock divide ratio</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSLAT</name>
                            <description>Bus latency</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSET</name>
                            <description>Data setup time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHLD</name>
                            <description>Address hold time</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ASET</name>
                            <description>Address setup time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNWTCFG0</name>
                    <displayName>SNWTCFG0</displayName>
                    <description>SRAM/NOR flash write timing configuration registe 0</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WASYNCMOD</name>
                            <description>Asynchronous access mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WBUSLAT</name>
                            <description>Bus latency</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDSET</name>
                            <description>Data setup time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAHLD</name>
                            <description>Address hold time</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WASET</name>
                            <description>Address setup time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SNWTCFG1</name>
                    <displayName>SNWTCFG1</displayName>
                    <description>SRAM/NOR flash write timing configuration registe 1</description>
                    <addressOffset>0x10c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WASYNCMOD</name>
                            <description>Asynchronous access mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WBUSLAT</name>
                            <description>Bus latency</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDSET</name>
                            <description>Data setup time</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAHLD</name>
                            <description>Address hold time</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WASET</name>
                            <description>Address setup time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
