RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>SDTCFG0</name>
                    <displayName>SDTCFG0</displayName>
                    <description>SDRAM timing configuration registe 0</description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>RCD</name>
                            <description>Row to column delay</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPD</name>
                            <description>Row precharge delay</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WRD</name>
                            <description>Write recovery delay</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARFD</name>
                            <description>Auto refresh delay</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RASD</name>
                            <description>Row address select delay</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XSRD</name>
                            <description>Exit Self-refresh delay</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMRD</name>
                            <description>Load Mode Register Delay</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDTCFG1</name>
                    <displayName>SDTCFG1</displayName>
                    <description>SDRAM timing configuration registe 1</description>
                    <addressOffset>0x14c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>RCD</name>
                            <description>Row to column delay</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPD</name>
                            <description>Row precharge delay</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WRD</name>
                            <description>Write recovery delay</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARFD</name>
                            <description>Auto refresh delay</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RASD</name>
                            <description>Row address select delay</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XSRD</name>
                            <description>Exit Self-refresh delay</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LMRD</name>
                            <description>Load Mode Register Delay</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDCMD</name>
                    <displayName>SDCMD</displayName>
                    <description>SDRAM command register</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MRC</name>
                            <description>Mode register content</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NARF</name>
                            <description>Number of successive Auto-refresh</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DS0</name>
                            <description>Device select 0</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DS1</name>
                            <description>Device select 1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMD</name>
                            <description>Command</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDARI</name>
                    <displayName>SDARI</displayName>
                    <description>SDRAM auto-refresh interval register</description>
                    <addressOffset>0x154</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REIE</name>
                            <description>Refresh error interrupt Enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ARINTV</name>
                            <description>Auto-Refresh Interval</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REC</name>
                            <description>Refresh error flag clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDSTAT</name>
                    <displayName>SDSTAT</displayName>
                    <description>SDRAM status register</description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NRDY</name>
                            <description>Not Ready status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA1</name>
                            <description>Device1 status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STA0</name>
                            <description>Device 0 status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>REIF</name>
                            <description>Refresh error interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDRSCTL</name>
                    <displayName>SDRSCTL</displayName>
                    <description>SDRAM read sample control register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SDSC</name>
                            <description>Select the delayed sample clock of read data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSCR</name>
                            <description>Select sample cycle of read data</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSEN</name>
                            <description>Read sample enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
