RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FMC</name>
            <description>Flash memory controller</description>
            <groupName>FMC</groupName>
            <baseAddress>0x52002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FMC</name>
                <value>4</value>
            </interrupt>
            <registers>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>Unlock key register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>FMC_CTL unlock register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBKEY</name>
                    <displayName>OBKEY</displayName>
                    <description>Option byte unlock key register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OBKEY</name>
                            <description>These bits are only be written by software.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>Control register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>RSERRIE</name>
                            <description>Read secure error interrupt enable.</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPERRIE</name>
                            <description>Read protection error interrupt enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGSERRIE</name>
                            <description>Program sequence error interrupt enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WPERRIE</name>
                            <description>Erase/program protection error interrupt enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDIE</name>
                            <description>End of operation interrupt enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>START</name>
                            <description>Send erase command to FMC</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGCHEN</name>
                            <description>Check programming area enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MER</name>
                            <description>Mass erase command bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SER</name>
                            <description>Sector erase command bit</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PG</name>
                            <description>Main Flash program command bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LK</name>
                            <description>FMC_CTL lock bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OBMERR</name>
                            <description>Option byte modify error flag .</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RSERR</name>
                            <description>Read secure error flag bit.</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPERR</name>
                            <description>Read protection error flag bit.</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGSERR</name>
                            <description>Program sequence error flag bit.</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WPERR</name>
                            <description>Erase/program protection error flag bit.</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ENDF</name>
                            <description>End of operation flag bit.</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>The Flash is busy bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR</name>
                    <displayName>ADDR</displayName>
                    <description>Address register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash erase command address bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBCTL</name>
                    <displayName>OBCTL</displayName>
                    <description>Option byte control register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>OBMERRIE</name>
                            <description>Option byte modify error interrupt enable.</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OBSTART</name>
                            <description>Send option byte change command to FMC bit.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OBLK</name>
                            <description>FMC_OBCTL lock bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBSTAT0_EFT</name>
                    <displayName>OBSTAT0_EFT</displayName>
                    <description>Option byte status register 0</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IOSPDOPEN</name>
                            <description>Allowed enable status bit for I/O speed optimization at low-voltage.</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTCM1ECCEN</name>
                            <description>DTCM1 ECC function enable status bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTCM0ECCEN</name>
                            <description>DTCM0 ECC function enable status bit</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ITCMECCEN</name>
                            <description>ITCM ECC function enable status bit</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCR</name>
                            <description>Secure mode status bit</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FWDGSPD_STDBY</name>
                            <description>FWDGT suspend option in standby mode status bit</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FWDGSPD_DPSLP</name>
                            <description>FWDGT suspend option in deepsleep mode status bit</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SPC</name>
                            <description>Security protection level option byte status bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nRST_STDBY</name>
                            <description>Option byte standby reset status bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nRST_DPSLP</name>
                            <description>Option byte deepsleep reset status bit</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>nWDG_HW</name>
                            <description>Watchdog status bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BOR_TH</name>
                            <description>BOR threshold status bits</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBSTAT0_MDF</name>
                    <displayName>OBSTAT0_MDF</displayName>
                    <description>Option byte status register 0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IOSPDOPEN</name>
                            <description>Allowed enable configuration bit for I/O speed optimization at low-voltage.</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTCM1ECCEN</name>
                            <description>DTCM1 ECC function enable configuration bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTCM0ECCEN</name>
                            <description>DTCM0 ECC function enable configuration bit</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITCMECCEN</name>
                            <description>ITCM ECC function enable configuration bit</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCR</name>
                            <description>Secure mode configuration bit</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FWDGSPD_STDBY</name>
                            <description>FWDGT suspend option in standby mode configuration bit</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FWDGSPD_DPSLP</name>
                            <description>FWDGT suspend option in deepsleep mode configuration bit</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPC</name>
                            <description>Security protection level option configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>nRST_STDBY</name>
                            <description>Option byte standby reset configuration bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>nRST_DPSLP</name>
                            <description>Option byte deepsleep reset configuration bit</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>nWDG_HW</name>
                            <description>Watchdog configuration bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BOR_TH</name>
                            <description>BOR threshold configuration bits</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCRPADDR_EFT</name>
                    <displayName>DCRPADDR_EFT</displayName>
                    <description>DCRP address register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DCRP_EREN</name>
                            <description>DCRP area erase enable status bit.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DCRP_AREA_END</name>
                            <description>DCRP area end address status bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DCRP_AREA_START</name>
                            <description>DCRP area start address status bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
