RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>DCRPADDR_MDF</name>
                    <displayName>DCRPADDR_MDF</displayName>
                    <description>DCRP address register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DCRP_EREN</name>
                            <description>DCRP area erase enable configuration bit.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCRP_AREA_END</name>
                            <description>DCRP area end address configuration bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DCRP_AREA_START</name>
                            <description>DCRP area start address configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRADDR_EFT</name>
                    <displayName>SCRADDR_EFT</displayName>
                    <description>Secure address register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCR_EREN</name>
                            <description>Secure user area erase enable option status bit.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCR_AREA_END</name>
                            <description>Secure user area end address status bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCR_AREA_START</name>
                            <description>Secure user area start address status bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCRADDR_MDF</name>
                    <displayName>SCRADDR_MDF</displayName>
                    <description>Secure address register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SCR_EREN</name>
                            <description>Secure user area erase enable option configuration bit.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCR_AREA_END</name>
                            <description>Secure user area end address configuration bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCR_AREA_START</name>
                            <description>Secure user area start address configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WP_EFT</name>
                    <displayName>WP_EFT</displayName>
                    <description>Erase/program protection register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WP</name>
                            <description>Sector erase/program protection option status bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WP_MDF</name>
                    <displayName>WP_MDF</displayName>
                    <description>Erase/program protection register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WP</name>
                            <description>Sector erase/program protection option configuration bit</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>22</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BTADDR_EFT</name>
                    <displayName>BTADDR_EFT</displayName>
                    <description>Boot address register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BOOT_ADDR1</name>
                            <description>Boot address 1 status bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BOOT_ADDR0</name>
                            <description>Boot address 0 status bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BTADDR_MDF</name>
                    <displayName>BTADDR_MDF</displayName>
                    <description>Boot address register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BOOT_ADDR1</name>
                            <description>Boot address 1 configuration bits.</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BOOT_ADDR0</name>
                            <description>Boot address 0 configuration bits.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBSTAT1_EFT</name>
                    <displayName>OBSTAT1_EFT</displayName>
                    <description>Option byte status register 1</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>User defined option byte data status value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTCM_SZ_SHRRAM</name>
                            <description>DTCM size of shared RAM status bits.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ITCM_SZ_SHRRAM</name>
                            <description>ITCM size of shared RAM status bits.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBSTAT1_MDF</name>
                    <displayName>OBSTAT1_MDF</displayName>
                    <description>Option byte status register 1</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>User defined option byte data configuration value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTCM_SZ_SHRRAM</name>
                            <description>DTCM size of shared RAM configuration bits.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITCM_SZ_SHRRAM</name>
                            <description>ITCM size of shared RAM configuration bits.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NODEC</name>
                    <displayName>NODEC</displayName>
                    <description>NO-RTDEC area register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000000FF</resetValue>
                    <fields>
                        <field>
                            <name>NODEC_AREA_END</name>
                            <description>NO-RTDEC area end address</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NODEC_AREA_START</name>
                            <description>No-RTDEC area start address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AESIV0_EFT</name>
                    <displayName>AESIV0_EFT</displayName>
                    <description>AES IV regist 0</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AESIV</name>
                            <description>AES initialization vector status value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AESIV1_EFT</name>
                    <displayName>AESIV1_EFT</displayName>
                    <description>AES IV regist 1</description>
                    <addressOffset>0x6c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AESIV</name>
                            <description>AES initialization vector status value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AESIV2_EFT</name>
                    <displayName>AESIV2_EFT</displayName>
                    <description>AES IV regist 2</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AESIV</name>
                            <description>AES initialization vector status value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AESIV0_MDF</name>
                    <displayName>AESIV0_MDF</displayName>
                    <description>AES IV regist 0</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AESIV</name>
                            <description>AES initialization vector configuration value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AESIV1_MDF</name>
                    <displayName>AESIV1_MDF</displayName>
                    <description>AES IV regist 1</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AESIV</name>
                            <description>AES initialization vector configuration value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AESIV2_MDF</name>
                    <displayName>AESIV2_MDF</displayName>
                    <description>AES IV regist 2</description>
                    <addressOffset>0x7c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AESIV</name>
                            <description>AES initialization vector configuration value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PID0</name>
                    <displayName>PID0</displayName>
                    <description>Product ID register 0</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PID</name>
                            <description>Product reserved ID code register x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PID1</name>
                    <displayName>PID1</displayName>
                    <description>Product ID register 1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PID</name>
                            <description>Product reserved ID code register x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
