RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>PUD</name>
                    <displayName>PUD</displayName>
                    <description>
                        GPIO port pull-up/pull-down
                        register
                    </description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x64000000</resetValue>
                    <fields>
                        <field>
                            <name>PUD15</name>
                            <description>Port 15 pull-up or pull-down bits</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD14</name>
                            <description>Port 14 pull-up or pull-down bits</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD13</name>
                            <description>Port 13 pull-up or pull-down bits</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD12</name>
                            <description>Port 12 pull-up or pull-down bits</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD11</name>
                            <description>Port 11 pull-up or pull-down bits</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD10</name>
                            <description>Port 10 pull-up or pull-down bits</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD9</name>
                            <description>Port 9 pull-up or pull-down bits</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD8</name>
                            <description>Port 8 pull-up or pull-down bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD7</name>
                            <description>Port 7 pull-up or pull-down bits</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD6</name>
                            <description>Port 6 pull-up or pull-down bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD5</name>
                            <description>Port 5 pull-up or pull-down bits</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD4</name>
                            <description>Port 4 pull-up or pull-down bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD3</name>
                            <description>Port 3 pull-up or pull-down bits</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD2</name>
                            <description>Port 2 pull-up or pull-down bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD1</name>
                            <description>Port 1 pull-up or pull-down bits</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PUD0</name>
                            <description>Port 0 pull-up or pull-down bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISTAT</name>
                    <displayName>ISTAT</displayName>
                    <description>GPIO port input status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ISTAT15</name>
                            <description>
                                Port input status (y =
                                15)
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT14</name>
                            <description>
                                Port input status (y =
                                14)
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT13</name>
                            <description>
                                Port input status (y =
                                13)
                            </description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT12</name>
                            <description>
                                Port input status (y =
                                12)
                            </description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT11</name>
                            <description>
                                Port input status (y =
                                11)
                            </description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT10</name>
                            <description>
                                Port input status (y =
                                10)
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT9</name>
                            <description>
                                Port input status (y =
                                9)
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT8</name>
                            <description>
                                Port input status (y =
                                8)
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT7</name>
                            <description>
                                Port input status (y =
                                7)
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT6</name>
                            <description>
                                Port input status (y =
                                6)
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT5</name>
                            <description>
                                Port input status (y =
                                5)
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT4</name>
                            <description>
                                Port input status (y =
                                4)
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT3</name>
                            <description>
                                Port input status (y =
                                3)
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT2</name>
                            <description>
                                Port input status (y =
                                2)
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT1</name>
                            <description>
                                Port input status (y =
                                1)
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ISTAT0</name>
                            <description>
                                Port input status (y =
                                0)
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OCTL</name>
                    <displayName>OCTL</displayName>
                    <description>GPIO port output control  register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OCTL15</name>
                            <description>
                                Port output control (y =
                                15)
                            </description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL14</name>
                            <description>
                                Port output control (y =
                                14)
                            </description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL13</name>
                            <description>
                                Port output control (y =
                                13)
                            </description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL12</name>
                            <description>
                                Port output control (y =
                                12)
                            </description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL11</name>
                            <description>
                                Port output control (y =
                                11)
                            </description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL10</name>
                            <description>
                                Port output control (y =
                                10)
                            </description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL9</name>
                            <description>
                                Port output control (y =
                                9)
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL8</name>
                            <description>
                                Port output control (y =
                                8)
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL7</name>
                            <description>
                                Port output control (y =
                                7)
                            </description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL6</name>
                            <description>
                                Port output control (y =
                                6)
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL5</name>
                            <description>
                                Port output control (y =
                                5)
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL4</name>
                            <description>
                                Port output control (y =
                                4)
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL3</name>
                            <description>
                                Port output control (y =
                                3)
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL2</name>
                            <description>
                                Port output control (y =
                                2)
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL1</name>
                            <description>
                                Port output control (y =
                                1)
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCTL0</name>
                            <description>
                                Port output control (y =
                                0)
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
