RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>CH6CTL</name>
                    <displayName>CH6CTL</displayName>
                    <description>Channel 6 control regist</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPM</name>
                            <description>Data packing mode for HPDF_CHxPDI register</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSD</name>
                            <description>Channel x multiplexer select input data source</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHPINSEL</name>
                            <description>Channel inputs pins selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel x enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLEN</name>
                            <description>Clock loss detector enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMEN</name>
                            <description>Malfunction monitor enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPICKSS</name>
                            <description>SPI clock source select</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SITYP</name>
                            <description>Serial interface type</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7CTL</name>
                    <displayName>CH7CTL</displayName>
                    <description>Channel 7 control regist</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DPM</name>
                            <description>Data packing mode for HPDF_CHxPDI register</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSD</name>
                            <description>Channel x multiplexer select input data source</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHPINSEL</name>
                            <description>Channel inputs pins selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel x enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLEN</name>
                            <description>Clock loss detector enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMEN</name>
                            <description>Malfunction monitor enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPICKSS</name>
                            <description>SPI clock source select</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SITYP</name>
                            <description>Serial interface type</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0CFG0</name>
                    <displayName>CH0CFG0</displayName>
                    <description>Channel 0 configuration register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CFG0</name>
                    <displayName>CH1CFG0</displayName>
                    <description>Channel 1 configuration register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2CFG0</name>
                    <displayName>CH2CFG0</displayName>
                    <description>Channel 2 configuration register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CFG0</name>
                    <displayName>CH3CFG0</displayName>
                    <description>Channel 3 configuration register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CFG0</name>
                    <displayName>CH4CFG0</displayName>
                    <description>Channel 4 configuration register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH5CFG0</name>
                    <displayName>CH5CFG0</displayName>
                    <description>Channel 5 configuration register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6CFG0</name>
                    <displayName>CH6CFG0</displayName>
                    <description>Channel 6 configuration register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7CFG0</name>
                    <displayName>CH7CFG0</displayName>
                    <description>Channel 7 configuration register</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOFF</name>
                            <description>24-bit calibration offset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTRS</name>
                            <description>Data right bit-shift</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0CFG1</name>
                    <displayName>CH0CFG1</displayName>
                    <description>Channel 0 configuration register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CFG1</name>
                    <displayName>CH1CFG1</displayName>
                    <description>Channel 1 configuration register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2CFG1</name>
                    <displayName>CH2CFG1</displayName>
                    <description>Channel 2 configuration register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CFG1</name>
                    <displayName>CH3CFG1</displayName>
                    <description>Channel 3 configuration register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
