RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>CH4CFG1</name>
                    <displayName>CH4CFG1</displayName>
                    <description>Channel 4 configuration register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH5CFG1</name>
                    <displayName>CH5CFG1</displayName>
                    <description>Channel 5 configuration register</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6CFG1</name>
                    <displayName>CH6CFG1</displayName>
                    <description>Channel 6 configuration register</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7CFG1</name>
                    <displayName>CH7CFG1</displayName>
                    <description>Channel 7 configuration register</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMSFO</name>
                            <description>Threshold monitor Sinc filter order selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMFOR</name>
                            <description>Threshold monitor filter oversampling rate (decimation rate)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMBSD</name>
                            <description>Malfunction monitor break signal distribution</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MMCT</name>
                            <description>Malfunction monitor counter threshold</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0TMFDT</name>
                    <displayName>CH0TMFDT</displayName>
                    <description>Channel 0 threshold monitor filter data regist</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1TMFDT</name>
                    <displayName>CH1TMFDT</displayName>
                    <description>Channel 1 threshold monitor filter data regist</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2TMFDT</name>
                    <displayName>CH2TMFDT</displayName>
                    <description>Channel 2 threshold monitor filter data regist</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3TMFDT</name>
                    <displayName>CH3TMFDT</displayName>
                    <description>Channel 3 threshold monitor filter data regist</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4TMFDT</name>
                    <displayName>CH4TMFDT</displayName>
                    <description>Channel 4 threshold monitor filter data regist</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH5TMFDT</name>
                    <displayName>CH5TMFDT</displayName>
                    <description>Channel 5 threshold monitor filter data regist</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6TMFDT</name>
                    <displayName>CH6TMFDT</displayName>
                    <description>Channel 6 threshold monitor filter data regist</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7TMFDT</name>
                    <displayName>CH7TMFDT</displayName>
                    <description>Channel 7 threshold monitor filter data regist</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMDATA</name>
                            <description>Threshold monitor data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0PDI</name>
                    <displayName>CH0PDI</displayName>
                    <description>Channel 0 parallel data input regist</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1PDI</name>
                    <displayName>CH1PDI</displayName>
                    <description>Channel 1 parallel data input regist</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2PDI</name>
                    <displayName>CH2PDI</displayName>
                    <description>Channel 2 parallel data input regist</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3PDI</name>
                    <displayName>CH3PDI</displayName>
                    <description>Channel 3 parallel data input regist</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4PDI</name>
                    <displayName>CH4PDI</displayName>
                    <description>Channel 4 parallel data input regist</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH5PDI</name>
                    <displayName>CH5PDI</displayName>
                    <description>Channel 5 parallel data input regist</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH6PDI</name>
                    <displayName>CH6PDI</displayName>
                    <description>Channel 6 parallel data input regist</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH7PDI</name>
                    <displayName>CH7PDI</displayName>
                    <description>Channel 7 parallel data input regist</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATAIN1</name>
                            <description>Data input for channel x or channel x+1</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAIN0</name>
                            <description>Data input for channel x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
