RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>FLT0STAT</name>
                    <displayName>FLT0STAT</displayName>
                    <description>Filter 0 status regist</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00030000</resetValue>
                    <fields>
                        <field>
                            <name>MMF</name>
                            <description>Malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKLF</name>
                            <description>Clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCPF</name>
                            <description>Regular conversion in progress flag</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICPF</name>
                            <description>Inserted conversion in progress flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TMEOF</name>
                            <description>Threshold monitor event occurred flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCDOF</name>
                            <description>Regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICDOF</name>
                            <description>Inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCEF</name>
                            <description>Regular conversion end flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICEF</name>
                            <description>Inserted conversion end flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1STAT</name>
                    <displayName>FLT1STAT</displayName>
                    <description>Filter 1 status regist</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00030000</resetValue>
                    <fields>
                        <field>
                            <name>MMF</name>
                            <description>Malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKLF</name>
                            <description>Clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCPF</name>
                            <description>Regular conversion in progress flag</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICPF</name>
                            <description>Inserted conversion in progress flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TMEOF</name>
                            <description>Threshold monitor event occurred flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCDOF</name>
                            <description>Regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICDOF</name>
                            <description>Inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCEF</name>
                            <description>Regular conversion end flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICEF</name>
                            <description>Inserted conversion end flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2STAT</name>
                    <displayName>FLT2STAT</displayName>
                    <description>Filter 2 status regist</description>
                    <addressOffset>0x208</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00030000</resetValue>
                    <fields>
                        <field>
                            <name>MMF</name>
                            <description>Malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKLF</name>
                            <description>Clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCPF</name>
                            <description>Regular conversion in progress flag</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICPF</name>
                            <description>Inserted conversion in progress flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TMEOF</name>
                            <description>Threshold monitor event occurred flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCDOF</name>
                            <description>Regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICDOF</name>
                            <description>Inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCEF</name>
                            <description>Regular conversion end flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICEF</name>
                            <description>Inserted conversion end flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3STAT</name>
                    <displayName>FLT3STAT</displayName>
                    <description>Filter 3 status regist</description>
                    <addressOffset>0x288</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00030000</resetValue>
                    <fields>
                        <field>
                            <name>MMF</name>
                            <description>Malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CKLF</name>
                            <description>Clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCPF</name>
                            <description>Regular conversion in progress flag</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICPF</name>
                            <description>Inserted conversion in progress flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TMEOF</name>
                            <description>Threshold monitor event occurred flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCDOF</name>
                            <description>Regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICDOF</name>
                            <description>Inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RCEF</name>
                            <description>Regular conversion end flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ICEF</name>
                            <description>Inserted conversion end flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0INTC</name>
                    <displayName>FLT0INTC</displayName>
                    <description>Filter 0 interrupt flag clear regist</description>
                    <addressOffset>0x10c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Clear the malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLFC</name>
                            <description>Clear the clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCDOFC</name>
                            <description>Clear the regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICDOFC</name>
                            <description>Clear the inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1INTC</name>
                    <displayName>FLT1INTC</displayName>
                    <description>Filter 1 interrupt flag clear regist</description>
                    <addressOffset>0x18c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Clear the malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLFC</name>
                            <description>Clear the clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCDOFC</name>
                            <description>Clear the regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICDOFC</name>
                            <description>Clear the inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT2INTC</name>
                    <displayName>FLT2INTC</displayName>
                    <description>Filter 2 interrupt flag clear regist</description>
                    <addressOffset>0x20C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Clear the malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLFC</name>
                            <description>Clear the clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCDOFC</name>
                            <description>Clear the regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICDOFC</name>
                            <description>Clear the inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT3INTC</name>
                    <displayName>FLT3INTC</displayName>
                    <description>Filter 3 interrupt flag clear regist</description>
                    <addressOffset>0x28C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Clear the malfunction monitor flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKLFC</name>
                            <description>Clear the clock loss flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCDOFC</name>
                            <description>Clear the regular conversion data overflow flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ICDOFC</name>
                            <description>Clear the inserted conversion data overflow flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT0ICGS</name>
                    <displayName>FLT0ICGS</displayName>
                    <description>Filter 0 inserted channel group selection regist</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>ICGSEL</name>
                            <description>Inserted channel group selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLT1ICGS</name>
                    <displayName>FLT1ICGS</displayName>
                    <description>Filter 1 inserted channel group selection regist</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>ICGSEL</name>
                            <description>Inserted channel group selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
