RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Transfer status register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>READDR</name>
                            <description>Received match address in slave mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>TR</name>
                            <description>Whether the I2C is a transmitter or a receiver in slave mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2CBSY</name>
                            <description>Busy flag</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMBALT</name>
                            <description>SMBus Alert</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMEOUT</name>
                            <description>TIMEOUT flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PECERR</name>
                            <description>PEC error</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUERR</name>
                            <description>Overrun/Underrun error in slave mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOSTARB</name>
                            <description>Arbitration Lost</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BERR</name>
                            <description>Bus error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCR</name>
                            <description>Transfer complete reload</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TC</name>
                            <description>Transfer complete in master mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPDET</name>
                            <description>STOP condition is detected on the bus</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NACK</name>
                            <description>Not Acknowledge flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDSEND</name>
                            <description>Address received matches in slave mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RBNE</name>
                            <description>I2C_RDATA is not empty during receiving</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TI</name>
                            <description>Transmit interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TBE</name>
                            <description>I2C_TDATA is empty during transmitting</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATC</name>
                    <displayName>STATC</displayName>
                    <description>Status clear register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMBALTC</name>
                            <description>SMBus Alert flag clear</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMEOUTC</name>
                            <description>TIMEOUT flag clear</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PECERRC</name>
                            <description>PEC error flag clear</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUERRC</name>
                            <description>Overrun/Underrun flag clear</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOSTARBC</name>
                            <description>Arbitration Lost flag clear</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BERRC</name>
                            <description>Bus error flag clear</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPDETC</name>
                            <description>STPDET flag clear</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NACKC</name>
                            <description>Not Acknowledge flag clear</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDSENDC</name>
                            <description>ADDSEND flag clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEC</name>
                    <displayName>PEC</displayName>
                    <description>Packet Error Check register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PECV</name>
                            <description>Packet Error Checking Value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDATA</name>
                    <displayName>RDATA</displayName>
                    <description>receive data register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RDATA</name>
                            <description>Receive data value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TDATA</name>
                    <displayName>TDATA</displayName>
                    <description>Transmit data register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TDATA</name>
                            <description>Transmit data value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL2</name>
                    <displayName>CTL2</displayName>
                    <description>Control register 2</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FE00</resetValue>
                    <fields>
                        <field>
                            <name>ADDM</name>
                            <description>
                                Defines which bits of ADDRESS
                                are compared with an incoming address byte
                            </description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
