RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>CH4STAT0</name>
                    <displayName>CH4STAT0</displayName>
                    <description>Channel 4 status register</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>REQAF</name>
                            <description>Channel x request active flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TCF</name>
                            <description>Channel x buffer transfer complete flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BTCF</name>
                            <description>Channel x block transfer complete flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MBTCF</name>
                            <description>Channel x multi-block transfer complete flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CHTCF</name>
                            <description>Channel x channel transfer complete flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERR</name>
                            <description>Channel x transfer error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4STATC</name>
                    <displayName>CH4STATC</displayName>
                    <description>Channel 4 status clear regist</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TCFC</name>
                            <description>Channel x buffer transfer complete flag clear</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>BTCFC</name>
                            <description>Channel x buffer block transfer complete flag clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MBTCFC</name>
                            <description>Channel x buffer multi-block transfer complete flag clear</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CHTCFC</name>
                            <description>Channel x channel transfer complete flag clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>ERRC</name>
                            <description>Channel x transfer error flag clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4STAT1</name>
                    <displayName>CH4STAT1</displayName>
                    <description>Channel 4 status register</description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BZERR</name>
                            <description>Block size error flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ASERR</name>
                            <description>Address and size error flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MDTERR</name>
                            <description>Mask data error flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LDTERR</name>
                            <description>Link data transfer error flag in the last transfer of the channel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TERRD</name>
                            <description>Transfer error direction</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ERRADDR</name>
                            <description>Transfer error address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CTL0</name>
                    <displayName>CH4CTL0</displayName>
                    <description>Channel 4 control register</description>
                    <addressOffset>0x14c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWREQ</name>
                            <description>Software request</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>WES</name>
                            <description>Word endianess swapping in double word</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HWES</name>
                            <description>Half word endianess swapping in word</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BES</name>
                            <description>Byte endianess swapping in half word</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMODEN</name>
                            <description>Secure mode enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRIO</name>
                            <description>Priority level</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCIE</name>
                            <description>Buffer transfer complete interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTCIE</name>
                            <description>Block transfer complete interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MBTCIE</name>
                            <description>Multi-block transfer complete interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHTCIE</name>
                            <description>Channel transfer complete interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>Transfer error interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CFG</name>
                    <displayName>CH4CFG</displayName>
                    <description>Channel 4 configure regist</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BWMOD</name>
                            <description>Bufferable write mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWREQMOD</name>
                            <description>Software request mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGMOD</name>
                            <description>Trigger mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAMOD</name>
                            <description>Padding and alignement mode</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PKEN</name>
                            <description>Pack enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTLEN</name>
                            <description>Buffer transfer length</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DBURST</name>
                            <description>Transfer burst type of destination</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SBURST</name>
                            <description>Transfer burst type of source</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIOS</name>
                            <description>Offset size of destination increment</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIOS</name>
                            <description>Offset size of source increment</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DWIDTH</name>
                            <description>Data size of destination</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWIDTH</name>
                            <description>Data size of source</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIMOD</name>
                            <description>Destination increment mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIMOD</name>
                            <description>Source increment mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4BTCFG</name>
                    <displayName>CH4BTCFG</displayName>
                    <description>Channel 4 block transfer configure regist</description>
                    <addressOffset>0x154</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BRNUM</name>
                            <description>Multi-block number</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DADDRUM</name>
                            <description>Multi-block destination address update mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUM</name>
                            <description>Multi-block source address update mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TBNUM</name>
                            <description>Transfer byte number in block</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4SADDR</name>
                    <displayName>CH4SADDR</displayName>
                    <description>Channel 4 source address regist</description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SADDR</name>
                            <description>Source address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4DADDR</name>
                    <displayName>CH4DADDR</displayName>
                    <description>Channel 4 destination address regist</description>
                    <addressOffset>0x15c</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDR</name>
                            <description>Destination address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4MBADDRU</name>
                    <displayName>CH4MBADDRU</displayName>
                    <description>Channel 4 multi-block address update regist</description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADDRUV</name>
                            <description>Destination address update value</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SADDRUV</name>
                            <description>Source address update value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4LADDR</name>
                    <displayName>CH4LADDR</displayName>
                    <description>Channel 4 link address regist</description>
                    <addressOffset>0x164</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LADDR</name>
                            <description>Link address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
