RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OSPIM</name>
            <description>OSPI I/O Manager</description>
            <groupName>OSPIM</groupName>
            <baseAddress>0x5200B400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PCFG0</name>
                    <displayName>PCFG0</displayName>
                    <description>Port configuration regist 0</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x03010111</resetValue>
                    <fields>
                        <field>
                            <name>SCKEN</name>
                            <description>Enable for SCK of port x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPCK</name>
                            <description>Source selection for SCK of port x</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NCSEN</name>
                            <description>Enable for CSN of port x</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPCS</name>
                            <description>Source selection for CSN of port x</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POLEN</name>
                            <description>Enable for IO[3:0] of port x</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPLIO</name>
                            <description>Source selection for IO[3:0] of port x</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POHEN</name>
                            <description>Enable for IO[7:4] of port x</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPHIO</name>
                            <description>Source selection for IO[7:4] of port x</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCFG1</name>
                    <displayName>PCFG1</displayName>
                    <description>Port configuration regist 1</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x07050333</resetValue>
                    <fields>
                        <field>
                            <name>SCKEN</name>
                            <description>Enable for SCK of port x</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPCK</name>
                            <description>Source selection for SCK of port x</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NCSEN</name>
                            <description>Enable for CSN of port x</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPCS</name>
                            <description>Source selection for CSN of port x</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POLEN</name>
                            <description>Enable for IO[3:0] of port x</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPLIO</name>
                            <description>Source selection for IO[3:0] of port x</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POHEN</name>
                            <description>Enable for IO[7:4] of port x</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SRCPHIO</name>
                            <description>Source selection for IO[7:4] of port x</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
