RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OSPI0</name>
            <description>Octal-SPI Interface 0</description>
            <groupName>OSPI</groupName>
            <baseAddress>0x52005000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>OSPI0</name>
                <value>92</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL</name>
                    <displayName>CTL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000010</resetValue>
                    <fields>
                        <field>
                            <name>FMOD</name>
                            <description>Functional mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPMOD</name>
                            <description>Status polling match mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPS</name>
                            <description>Status polling mode stop</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SMIE</name>
                            <description>Status match interrupt enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTIE</name>
                            <description>FIFO threshold interrupt enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TCIE</name>
                            <description>Transfer complete interrupt enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TERRIE</name>
                            <description>Transfer error interrupt enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTL</name>
                            <description>FIFO threshold level</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMA enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPIEN</name>
                            <description>Enable OSPI</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCFG0</name>
                    <displayName>DCFG0</displayName>
                    <description>Device configuration register 0</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DTYSEL</name>
                            <description>Select device type</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MESZ</name>
                            <description>Memory size</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSHC</name>
                            <description>Chip select high cycle</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DFCG1</name>
                    <displayName>DFCG1</displayName>
                    <description>Device configuration register 1</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WPSZ</name>
                            <description>Wrap size</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSC</name>
                            <description>This field defines the scaler factor for generating SCK based on the kernel clock (value+1)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <displayName>STAT</displayName>
                    <description>Status register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000004</resetValue>
                    <fields>
                        <field>
                            <name>FL</name>
                            <description>FIFO level</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>Busy</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SM</name>
                            <description>Status match flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FT</name>
                            <description>FIFO threshold flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TC</name>
                            <description>Transfer complete flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TERR</name>
                            <description>Transfer error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATC</name>
                    <displayName>STATC</displayName>
                    <description>Status clear register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMC</name>
                            <description>Clear status match flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TCC</name>
                            <description>Clear transfer complete flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>TERRC</name>
                            <description>Clear transfer error flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTLEN</name>
                    <displayName>DTLEN</displayName>
                    <description>Data length register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DTLEN</name>
                            <description>Data length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR</name>
                    <displayName>ADDR</displayName>
                    <description>Address register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>Data register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATMK</name>
                    <displayName>STATMK</displayName>
                    <description>Status mask register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MASK</name>
                            <description>Status mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATMATCH</name>
                    <displayName>STATMATCH</displayName>
                    <description>Status match register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MATCH</name>
                            <description>Status match</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTERVAL</name>
                    <displayName>INTERVAL</displayName>
                    <description>Interval register</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTERVAL</name>
                            <description>Interval cycle</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TCFG</name>
                    <displayName>TCFG</displayName>
                    <description>Transfer configuration register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DADTR</name>
                            <description>Data double transfer rate</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATAMOD</name>
                            <description>Data mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALTESZ</name>
                            <description>Alternate bytes size</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ABDTR</name>
                            <description>Alternate bytes double transfer rate</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALTEMOD</name>
                            <description>Alternate bytes mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRSZ</name>
                            <description>Address size</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRDTR</name>
                            <description>Address double transfer rate</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRMOD</name>
                            <description>Address mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSSZ</name>
                            <description>Instruction size</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IMOD</name>
                            <description>Instruction mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMCFG</name>
                    <displayName>TIMCFG</displayName>
                    <description>Timing configuration register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SSAMPLE</name>
                            <description>Sample shift</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DEHQC</name>
                            <description>Delay hold 1/4 cycle</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DUMYC</name>
                            <description>Number of dummy cycles</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INS</name>
                    <displayName>INS</displayName>
                    <description>Instruction register</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INSTRUCTION</name>
                            <description>Instruction</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALTE</name>
                    <displayName>ALTE</displayName>
                    <description>Alternate bytes register</description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ALTE</name>
                            <description>Alternate bytes</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
