RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>APB2RST</name>
                    <displayName>APB2RST</displayName>
                    <description>APB2 reset register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TRIGSELRST</name>
                            <description>TRIGSEL reset</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EDOUTRST</name>
                            <description>EDOUT reset</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER44RST</name>
                            <description>TIMER44 reset</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER43RST</name>
                            <description>TIMER43 reset</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER42RST</name>
                            <description>TIMER42 reset</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER41RST</name>
                            <description>TIMER41 reset</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER40RST</name>
                            <description>TIMER40 reset</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI5RST</name>
                            <description>SPI5 reset</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI4RST</name>
                            <description>SPI4 reset</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HPDFRST</name>
                            <description>HPDF reset</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER16RST</name>
                            <description>TIMER16 reset</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER15RST</name>
                            <description>TIMER15 reset</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER14RST</name>
                            <description>TIMER14 reset</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI3RST</name>
                            <description>SPI3 reset</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI0RST</name>
                            <description>SPI0 reset</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC2RST</name>
                            <description>ADC2 reset</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC1RST</name>
                            <description>ADC1 reset</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC0RST</name>
                            <description>ADC0 reset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART5RST</name>
                            <description>USART5 reset</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART0RST</name>
                            <description>USART0 reset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER7RST</name>
                            <description>TIMER7 reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER0RST</name>
                            <description>TIMER0 reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB3RST</name>
                    <displayName>APB3RST</displayName>
                    <description>APB3 reset register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WWDGTRST</name>
                            <description>WWDGT reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB4RST</name>
                    <displayName>APB4RST</displayName>
                    <description>APB4 reset register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PMURST</name>
                            <description>PMU reset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPDTSRST</name>
                            <description>LPDTS reset</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VREFRST</name>
                            <description>VREF reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPRST</name>
                            <description>CMP reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSCFGRST</name>
                            <description>SYSCFG reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB1EN</name>
                    <displayName>AHB1EN</displayName>
                    <description>AHB1 enable register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>USBHS1ULPIEN</name>
                            <description>USBHS1 ULPI clock enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1EN</name>
                            <description>USBHS1 clock enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAMUXEN</name>
                            <description>DMAMUX clock enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA1EN</name>
                            <description>DMA1 clock enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA0EN</name>
                            <description>DMA0 clock enable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0ULPIEN</name>
                            <description>USBHS0 ULPI clock enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0EN</name>
                            <description>USBHS0 clock enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB2EN</name>
                    <displayName>AHB2EN</displayName>
                    <description>AHB2 enable register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000100</resetValue>
                    <fields>
                        <field>
                            <name>RAMECCMU1EN</name>
                            <description>RAMECCMU1 clock enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMUEN</name>
                            <description>TMU clock enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRNGEN</name>
                            <description>TRNG clock enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FACEN</name>
                            <description>FAC clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB3EN</name>
                    <displayName>AHB3EN</displayName>
                    <description>AHB3 enable register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00008400</resetValue>
                    <fields>
                        <field>
                            <name>CPUEN</name>
                            <description>CPU clock enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMECCMU0EN</name>
                            <description>RAMECCMU0 clock enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPI1EN</name>
                            <description>OSPI1 clock enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPI0EN</name>
                            <description>OSPI0 clock enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPIMEN</name>
                            <description>OSPIM clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDMAEN</name>
                            <description>MDMA clock enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXMCEN</name>
                            <description>EXMC clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB4EN</name>
                    <displayName>AHB4EN</displayName>
                    <description>AHB4 enable register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CRCEN</name>
                            <description>CRC clock enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKPSRAMEN</name>
                            <description>Backup SRAM clock enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHEN</name>
                            <description>GPIO port H clock enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGEN</name>
                            <description>GPIO port G clock enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PFEN</name>
                            <description>GPIO port F clock enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEEN</name>
                            <description>GPIO port E clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDEN</name>
                            <description>GPIO port D clock enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCEN</name>
                            <description>GPIO port C clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBEN</name>
                            <description>GPIO port B clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PAEN</name>
                            <description>GPIO port A clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
