RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>AHB2SPEN</name>
                    <displayName>AHB2SPEN</displayName>
                    <description>AHB2 sleep mode enable register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000001DF</resetValue>
                    <fields>
                        <field>
                            <name>RAMECCMU1SPEN</name>
                            <description>RAMECCMU1 clock enable when sleep mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TMUSPEN</name>
                            <description>TMU clock enable when sleep mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRNGSPEN</name>
                            <description>TRNG clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FACSPEN</name>
                            <description>FAC clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB3SPEN</name>
                    <displayName>AHB3SPEN</displayName>
                    <description>AHB3 sleep mode enable register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000C77F</resetValue>
                    <fields>
                        <field>
                            <name>FMCSPEN</name>
                            <description>FMC clock enable when sleep mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AXISRAMSPEN</name>
                            <description>AXI SRAM clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RAMECCMU0SPEN</name>
                            <description>RAMECCMU0 clock enable when sleep mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPI1SPEN</name>
                            <description>OSPI1 clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPI0SPEN</name>
                            <description>OSPI0 clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSPIMSPEN</name>
                            <description>OSPIM clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MDMASPEN</name>
                            <description>MDMA clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXMCSPEN</name>
                            <description>EXMC clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AHB4SPEN</name>
                    <displayName>AHB4SPEN</displayName>
                    <description>AHB4 sleep mode enable register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x000063FF</resetValue>
                    <fields>
                        <field>
                            <name>CRCSPEN</name>
                            <description>CRC clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BKPSRAMSPEN</name>
                            <description>Backup SRAM clock enable when sleep mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PHSPEN</name>
                            <description>GPIO port H clock enable when sleep mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGSPEN</name>
                            <description>GPIO port G clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PFSPEN</name>
                            <description>GPIO port F clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PESPEN</name>
                            <description>GPIO port E clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDSPEN</name>
                            <description>GPIO port D clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCSPEN</name>
                            <description>GPIO port C clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBSPEN</name>
                            <description>GPIO port B clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PASPEN</name>
                            <description>GPIO port A clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB1SPEN</name>
                    <displayName>APB1SPEN</displayName>
                    <description>APB1 sleep mode enable register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xF9FFEFFF</resetValue>
                    <fields>
                        <field>
                            <name>UART7SPEN</name>
                            <description>UART7 clock enable when sleep mode</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART6SPEN</name>
                            <description>UART6 clock enable when sleep mode</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACSPEN</name>
                            <description>DAC clock enable when sleep mode</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACHOLDSPEN</name>
                            <description>DAC hold clock enable when sleep mode</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CTCSPEN</name>
                            <description>CTC clock enable when sleep mode</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3SPEN</name>
                            <description>I2C3 clock enable when sleep mode</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2SPEN</name>
                            <description>I2C2 clock enable when sleep mode</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1SPEN</name>
                            <description>I2C1 clock enable when sleep mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C0SPEN</name>
                            <description>I2C0 clock enable when sleep mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART4SPEN</name>
                            <description>UART4 clock enable when sleep mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART3SPEN</name>
                            <description>UART3 clock enable when sleep mode</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART2SPEN</name>
                            <description>USART2 clock enable when sleep mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1SPEN</name>
                            <description>USART1 clock enable when sleep mode</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI2SPEN</name>
                            <description>SPI2 clock enable when sleep mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI1SPEN</name>
                            <description>SPI1 clock enable when sleep mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER51SPEN</name>
                            <description>TIMER51 clock enable when sleep mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER50SPEN</name>
                            <description>TIMER50 clock enable when sleep mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER23SPEN</name>
                            <description>TIMER23 clock enable when sleep mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER22SPEN</name>
                            <description>TIMER22 clock enable when sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER6SPEN</name>
                            <description>TIMER6 clock enable when sleep mode</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER5SPEN</name>
                            <description>TIMER5 clock enable when sleep mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER4SPEN</name>
                            <description>TIMER4 clock enable when sleep mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER3SPEN</name>
                            <description>TIMER3 clock enable when sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER2SPEN</name>
                            <description>TIMER2 clock enable when sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMER1SPEN</name>
                            <description>TIMER1 clock enable when sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
