RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>PLLADDCTL</name>
                    <displayName>PLLADDCTL</displayName>
                    <description>PLL clock additional control register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <resetValue>0xFF810101</resetValue>
                    <fields>
                        <field>
                            <name>PLL2PEN</name>
                            <description>PLL2P divider output enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2REN</name>
                            <description>PLL2R divider output enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2QEN</name>
                            <description>PLL2Q divider output enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1PEN</name>
                            <description>PLL1P divider output enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1REN</name>
                            <description>PLL1R divider output enable</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1QEN</name>
                            <description>PLL1Q divider output enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0PEN</name>
                            <description>PLL0P divider output enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0REN</name>
                            <description>PLL0R divider output enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0QEN</name>
                            <description>PLL0Q divider output enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2Q</name>
                            <description>The PLL2Q output frequency division factor from PLL2 VCO clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1Q</name>
                            <description>The PLL1Q output frequency division factor from PLL1 VCO clock</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0Q</name>
                            <description>The PLL0Q output frequency division factor from PLL0 VCO clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL1</name>
                    <displayName>PLL1</displayName>
                    <description>PLL1 register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x01012020</resetValue>
                    <fields>
                        <field>
                            <name>PLL1R</name>
                            <description>The PLL1R output frequency division factor from PLL1 VCO clock</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1P</name>
                            <description>The PLL1P output frequency division factor from PLL1 VCO clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1N</name>
                            <description>The PLL1 VCO clock multiplication factor</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>9</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1PSC</name>
                            <description>The PLL1 VCO source clock prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL2</name>
                    <displayName>PLL2</displayName>
                    <description>PLL2 register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x01012020</resetValue>
                    <fields>
                        <field>
                            <name>PLL2R</name>
                            <description>The PLL2R output frequency division factor from PLL2 VCO clock</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2P</name>
                            <description>The PLL2 P output frequency division factor from PLL2 VCO clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2N</name>
                            <description>The PLL2 VCO clock multiplication factor</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>9</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2PSC</name>
                            <description>The PLL2 VCO source clock prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG1</name>
                    <displayName>CFG1</displayName>
                    <description>Clock configuration register 1</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00003F00</resetValue>
                    <fields>
                        <field>
                            <name>HPDFSEL</name>
                            <description>HPDF clock source selection</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIMERSEL</name>
                            <description>TIMER clock selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART5SEL</name>
                            <description>USART5 clock source selection</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART2SEL</name>
                            <description>USART2 clock source selection</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART1SEL</name>
                            <description>USART1 clock source selection</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2RDIV</name>
                            <description>The divider factor from PLL2R clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERSEL</name>
                            <description>CK_PER clock selection</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN2SEL</name>
                            <description>CAN2 clock source selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1SEL</name>
                            <description>CAN1 clock selection</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0SEL</name>
                            <description>CAN0 clock source selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USART0SEL</name>
                            <description>USART0 clock source selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG2</name>
                    <displayName>CFG2</displayName>
                    <description>Clock configuration register 2</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HPDFASEL</name>
                            <description>HPDF audio clock source selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT1SEL</name>
                            <description>CKOUT1 clock source selection</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT1DIV</name>
                            <description>The CK_OUT1 divider which the CK_OUT1 frequency can be reduced</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT0SEL</name>
                            <description>CKOUT0 clock source selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKOUT0DIV</name>
                            <description>The CK_OUT0 divider which the CK_OUT0 frequency can be reduced</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG3</name>
                    <displayName>CFG3</displayName>
                    <description>Clock configuration register 3</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADC2SEL</name>
                            <description>ADC2 clock source selection</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC01SEL</name>
                            <description>ADC0 and ADC1 clock source selection</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSPWUSSEL</name>
                            <description>Deep-sleep wakeup system clock source selection</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C3SEL</name>
                            <description>I2C3 clock source selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C2SEL</name>
                            <description>I2C2 clock source selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1SEL</name>
                            <description>I2C1 clock source selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLALL</name>
                    <displayName>PLLALL</displayName>
                    <description>PLL all configuration register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLLSEL</name>
                            <description>PLLs clock source selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2VCOSEL</name>
                            <description>PLL2 VCO selection</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2RNG</name>
                            <description>PLL2 input clock range</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1VCOSEL</name>
                            <description>PLL1 VCO selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1RNG</name>
                            <description>PLL1 input clock range</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0VCOSEL</name>
                            <description>PLL0 VCO selection</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0RNG</name>
                            <description>PLL0 input clock range</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL0FRA</name>
                    <displayName>PLL0FRA</displayName>
                    <description>PLL0 fraction configuration register</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLL0FRAEN</name>
                            <description>PLL0 fractional latch enable.</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL0FRAN</name>
                            <description>Fractional part of the multiplication factor for PLL0 VCO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL1FRA</name>
                    <displayName>PLL1FRA</displayName>
                    <description>PLL1 fraction configuration register</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLL1FRAEN</name>
                            <description>PLL1 fractional latch enable.</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1FRAN</name>
                            <description>Fractional part of the multiplication factor for PLL1 VCO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
