RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>PLL2FRA</name>
                    <displayName>PLL2FRA</displayName>
                    <description>PLL2 fraction configuration register</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLL2FRAEN</name>
                            <description>PLL2 fractional latch enable.</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL2FRAN</name>
                            <description>Fractional part of the multiplication factor for PLL2 VCO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDCTL0</name>
                    <displayName>ADDCTL0</displayName>
                    <description>Additional clock control register 0</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x80000000</resetValue>
                    <fields>
                        <field>
                            <name>IRC48MCALIB</name>
                            <description>Internal 48MHz RC oscillator calibration value register</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC48MSTB</name>
                            <description>Internal 48MHz RC oscillator clock stabilization Flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IRC48MEN</name>
                            <description>Internal 48MHz RC oscillator enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL48MSEL</name>
                            <description>PLL48M clock selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CK48MSEL</name>
                            <description>48MHz clock selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDCTL1</name>
                    <displayName>ADDCTL1</displayName>
                    <description>Additional clock control register </description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00007080</resetValue>
                    <fields>
                        <field>
                            <name>PLLUSBHS1STB</name>
                            <description>PLLUSBHS1 clock stabilization flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1EN</name>
                            <description>PLLUSBHS1 clock enable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STB</name>
                            <description>PLLUSBHS0 clock stabilization flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0EN</name>
                            <description>PLLUSBHS0 clock enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MDSPEN</name>
                            <description>LPIRC4M clock enable in deepsleep mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC64MDIV</name>
                            <description>IRC64M clock divider</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MCALIB</name>
                            <description>LPIRC4M calibration value</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LPIRC4MADJ</name>
                            <description>LPIRC4M frequency clock trim adjust value</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPIRC4MSTB</name>
                            <description>LPIRC4M clock stabilization flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LPIRC4MEN</name>
                            <description>LPIRC4M clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDINT</name>
                    <displayName>ADDINT</displayName>
                    <description>Additional clock interrupt register</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IRC48MSTBIC</name>
                            <description>Internal 48 MHz RC oscillator Stabilization interrupt clear</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1STBIC</name>
                            <description>Internal PLL of USBHS1 Stabilization interrupt clear</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STBIC</name>
                            <description>Internal PLL of USBHS0 Stabilization interrupt clear</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>IRC48MSTBIE</name>
                            <description>Internal 48 MHz RC oscillator Stabilization interrupt enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1STBIE</name>
                            <description>Internal PLL of USBHS1 Stabilization interrupt enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STBIE</name>
                            <description>Internal PLL of USBHS0 Stabilization interrupt enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRC48MSTBIF</name>
                            <description>IRC48M stabilization interrupt flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1STBIF</name>
                            <description>Internal PLL of USBHS1 stabilization interrupt flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0STBIF</name>
                            <description>Internal PLL of USBHS0 stabilization interrupt flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG4</name>
                    <displayName>CFG4</displayName>
                    <description>Clock configuration register 4</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EXMCSEL</name>
                            <description>EXMC clock source selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBCLKCTL</name>
                    <displayName>USBCLKCTL</displayName>
                    <description>USB clock control register</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>USBHS1PSC</name>
                            <description>USBHS1 clock prescaler selection</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0PSC</name>
                            <description>USBHS0 clock prescaler selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS148MSEL</name>
                            <description>USBHS1 48M clock source selection</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1SWEN</name>
                            <description>USBHS1 clock source selection enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1PRESEL</name>
                            <description>PLLUSBHS1 clock source preselection</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1SEL</name>
                            <description>USBHS1 clock source selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS048MSEL</name>
                            <description>USBHS0 48M clock source selection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0SWEN</name>
                            <description>USBHS0 clock source selection enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0PRESEL</name>
                            <description>PLLUSBHS0 clock source preselection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0SEL</name>
                            <description>USBHS0 clock source selection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLUSBCFG</name>
                    <displayName>PLLUSBCFG</displayName>
                    <description>PLLUSB configuration register</description>
                    <addressOffset>0xD8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PLLUSBHS1MF</name>
                            <description>The PLLUSBHS1 clock multiplication factor</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS1DV</name>
                            <description>USBHS1 clock divider factor</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS1PREDV</name>
                            <description>PLLUSBHS1PREDV clock divide factor</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0MF</name>
                            <description>The PLLUSBHS0 clock multiplication factor</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>7</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>USBHS0DV</name>
                            <description>USBHS0 clock divider factor</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLUSBHS0PREDV</name>
                            <description>PLLUSBHS0PREDV clock divide factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDAPB2RST</name>
                    <displayName>ADDAPB2RST</displayName>
                    <description>APB2 additional reset register</description>
                    <addressOffset>0xE0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CAN2RST</name>
                            <description>CAN2 reset</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1RST</name>
                            <description>CAN1 reset</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0RST</name>
                            <description>CAN0 reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDAPB2EN</name>
                    <displayName>ADDAPB2EN</displayName>
                    <description>APB2 additional enable register</description>
                    <addressOffset>0xE4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CAN2EN</name>
                            <description>CAN2 clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1EN</name>
                            <description>CAN1 clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0EN</name>
                            <description>CAN0 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDAPB2SPEN</name>
                    <displayName>ADDAPB2SPEN</displayName>
                    <description>APB2 additional sleep enable register</description>
                    <addressOffset>0xE8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <field>
                            <name>CAN2SPEN</name>
                            <description>CAN2 clock enable in sleep mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN1SPEN</name>
                            <description>CAN1 clock enable in sleep mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAN0SPEN</name>
                            <description>CAN0 clock enable in sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
