RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TRIGSEL</name>
            <description>Trigger selection controller</description>
            <groupName>TRIGSEL</groupName>
            <baseAddress>0x40018400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>EXTOUT_0</name>
                    <displayName>EXTOUT_0</displayName>
                    <description>Trigger selection for EXTOUT register 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTOUT_1</name>
                    <displayName>EXTOUT_1</displayName>
                    <description>Trigger selection for EXTOUT register 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTOUT_2</name>
                    <displayName>EXTOUT_2</displayName>
                    <description>Trigger selection for EXTOUT register 2</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EXTOUT_3</name>
                    <displayName>EXTOUT_3</displayName>
                    <description>Trigger selection for EXTOUT register 3</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC0</name>
                    <displayName>ADC0</displayName>
                    <description>Trigger selection for ADC0 register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00001113</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1</name>
                    <displayName>ADC1</displayName>
                    <description>Trigger selection for ADC1 register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00001113</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC2</name>
                    <displayName>ADC2</displayName>
                    <description>Trigger selection for ADC2 register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00001113</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC0OUT0</name>
                    <displayName>DAC0OUT0</displayName>
                    <description>Trigger selection for DAC0_OUT0 register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000025</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAC0OUT1</name>
                    <displayName>DAC0OUT1</displayName>
                    <description>Trigger selection for DAC0_OUT1 register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000025</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER0BRKIN</name>
                    <displayName>TIMER0BRKIN</displayName>
                    <description>Trigger selection for TIMER0_BRKIN register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00232221</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL2</name>
                            <description>Trigger input source selection for output2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER7BRKIN</name>
                    <displayName>TIMER7BRKIN</displayName>
                    <description>Trigger selection for TIMER7_BRKIN register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0051504F</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL2</name>
                            <description>Trigger input source selection for output2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL1</name>
                            <description>Trigger input source selection for output1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER14BRKIN</name>
                    <displayName>TIMER14BRKIN</displayName>
                    <description>Trigger selection for TIMER14_BRKIN register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000059</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER15BRKIN</name>
                    <displayName>TIMER15BRKIN</displayName>
                    <description>Trigger selection for TIMER15_BRKIN register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000005E</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER16BRKIN</name>
                    <displayName>TIMER16BRKIN</displayName>
                    <description>Trigger selection for TIMER16_BRKIN register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000063</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER40BRKIN</name>
                    <displayName>TIMER40BRKIN</displayName>
                    <description>Trigger selection for TIMER40_BRKIN register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000082</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER41BRKIN</name>
                    <displayName>TIMER41BRKIN</displayName>
                    <description>Trigger selection for TIMER41_BRKIN register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000089</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
