RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>TIMER42BRKIN</name>
                    <displayName>TIMER42BRKIN</displayName>
                    <description>Trigger selection for TIMER42_BRKIN register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000090</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER43BRKIN</name>
                    <displayName>TIMER43BRKIN</displayName>
                    <description>Trigger selection for TIMER43_BRKIN register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000097</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER44BRKIN</name>
                    <displayName>TIMER44BRKIN</displayName>
                    <description>Trigger selection for TIMER44_BRKIN register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000009e</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN0</name>
                    <displayName>CAN0</displayName>
                    <description>Trigger selection for CAN0 register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000003d</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN1</name>
                    <displayName>CAN1</displayName>
                    <description>Trigger selection for CAN1 register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000003d</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAN2</name>
                    <displayName>CAN2</displayName>
                    <description>Trigger selection for CAN2 register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000003d</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPDTS</name>
                    <displayName>LPDTS</displayName>
                    <description>Trigger selection for LPDTS register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER0ETI</name>
                    <displayName>TIMER0ETI</displayName>
                    <description>Trigger selection for TIMER0_ETI register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000024</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER1ETI</name>
                    <displayName>TIMER1ETI</displayName>
                    <description>Trigger selection for TIMER1_ETI register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000002a</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER2ETI</name>
                    <displayName>TIMER2ETI</displayName>
                    <description>Trigger selection for TIMER2_ETI register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000030</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER3ETI</name>
                    <displayName>TIMER3ETI</displayName>
                    <description>Trigger selection for TIMER3_ETI register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000036</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER4ETI</name>
                    <displayName>TIMER4ETI</displayName>
                    <description>Trigger selection for TIMER4_ETI register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000003c</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER7ETI</name>
                    <displayName>TIMER7ETI</displayName>
                    <description>Trigger selection for TIMER7_ETI register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000052</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER22ETI</name>
                    <displayName>TIMER22ETI</displayName>
                    <description>Trigger selection for TIMER22_ETI register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000069</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER23ETI</name>
                    <displayName>TIMER23ETI</displayName>
                    <description>Trigger selection for TIMER23_ETI register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000006f</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EDOUT</name>
                    <displayName>EDOUT</displayName>
                    <description>Trigger selection for EDOUT register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPDF</name>
                    <displayName>HPDF</displayName>
                    <description>Trigger selection for HPDF register</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER0ITI14</name>
                    <displayName>TIMER0ITI14</displayName>
                    <description>Trigger selection for TIMER0_ITI14 register</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER1ITI14</name>
                    <displayName>TIMER1ITI14</displayName>
                    <description>Trigger selection for TIMER1_ITI14 register</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TIMER2ITI14</name>
                    <displayName>TIMER2ITI14</displayName>
                    <description>Trigger selection for TIMER2_ITI14 register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LK</name>
                            <description>TRIGSEL register lock.</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSEL0</name>
                            <description>Trigger input source selection for output0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
