RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>MCHCTL0_Input</name>
                    <displayName>MCHCTL0_Input</displayName>
                    <description>
                        Multi mode channel control register 0 (input
                        mode)
                    </description>
                    <alternateRegister>MCHCTL0_Output</alternateRegister>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH1MS_2</name>
                            <description>Multi mode channel 1 I/O mode selection</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH0MS_2</name>
                            <description>Multi mode channel 0 I/O mode selection</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH1CAPFLT</name>
                            <description>Multi mode channel 1 input capture filter control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCH1CAPPSC</name>
                            <description>Multi mode channel 1 input capture prescaler</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH1MS</name>
                            <description>Multi mode channel 1 I/O mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH0CAPFLT</name>
                            <description>Multi mode channel 0 input capture filter control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCH0CAPPSC</name>
                            <description>Multi mode channel 0 input capture prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH0MS</name>
                            <description>Multi mode channel 0 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCHCTL1_Output</name>
                    <displayName>MCHCTL1_Output</displayName>
                    <description>
                        Multi mode channel control register 1 (output
                        mode)
                    </description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH3MS_2</name>
                            <description>2th bit of MCH3MS</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH2MS_2</name>
                            <description>2th bit of MCH2MS</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH3COMCEN</name>
                            <description>Multi mode channel 3 output compare clear enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH3COMCTL</name>
                            <description>Multi mode channel 3 compare output control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCH3COMSEN</name>
                            <description>Multi mode channel 3 output compare shadow enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH3MS</name>
                            <description>Multi mode channel 3 I/O mode selection</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH2COMCEN</name>
                            <description>Multi mode channel 2 output compare clear enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH2COMCTL</name>
                            <description>Multi mode channel 2 compare output control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MCH2COMSEN</name>
                            <description>Multi mode channel 2 output compare shadow enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH2MS</name>
                            <description>Multi mode channel 2 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCHCTL1_Input</name>
                    <displayName>MCHCTL_Input</displayName>
                    <description>
                        Multi mode channel control register 1(input
                        mode)
                    </description>
                    <alternateRegister>MCHCTL1_Output</alternateRegister>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH3MS_2</name>
                            <description>2th bit of MCH3MS</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH2MS_2</name>
                            <description>2th bit of MCH2MS</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCH3CAPFLT</name>
                            <description>Multi mode channel 3 input capture filter control</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCH3CAPPSC</name>
                            <description>Multi mode channel 3 input capture prescaler</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH3MS</name>
                            <description>Multi mode channel 3 I/O mode selection.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH2CAPFLT</name>
                            <description>Multi mode channel 2 input capture filter control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MCH2CAPPSC</name>
                            <description>Multi mode channel 2 input capture prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH2MS</name>
                            <description>Multi mode channel 2 I/O mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCHFCTL2</name>
                    <displayName>MCHFCTL2</displayName>
                    <description>Multi mode channel control register  2</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH3FP</name>
                            <description>Multi mode channel 3 capture/compare free polarity</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH2FP</name>
                            <description>Multi mode channel 2 capture/compare free polarity</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH1FP</name>
                            <description>Multi mode channel 1 capture/compare free polarity</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MCH0FP</name>
                            <description>Multi mode channel 0 capture/compare free polarity</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCH0CV</name>
                    <displayName>MCH0CV</displayName>
                    <description>Multi mode channel 0 capture/compare value register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH0VAL</name>
                            <description>Capture/compare value of multi mode channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCH1CV</name>
                    <displayName>MCH1CV</displayName>
                    <description>Multi mode channel 1 capture/compare value register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH1VAL</name>
                            <description>Capture/compare value of multi mode channel 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCH2CV</name>
                    <displayName>MCH2CV</displayName>
                    <description>Multi mode channel 2 capture/compare value register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH2VAL</name>
                            <description>Capture/compare value of multi mode channel 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCH3CV</name>
                    <displayName>MCH3CV</displayName>
                    <description>Capture/compare value of multi mode channel 3</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MCH3VAL</name>
                            <description>Capture/compare value of channel 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH0COMV_ADD</name>
                    <displayName>CH0COMV_ADD</displayName>
                    <description>Channel 0 additional compare value register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH0COMVAL_ADD</name>
                            <description>Additional compare value of channel 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1COMV_ADD</name>
                    <displayName>CH1COMV_ADD</displayName>
                    <description>Channel 1 additional compare value register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH1COMVAL_ADD</name>
                            <description>Additional compare value of channel 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2COMV_ADD</name>
                    <displayName>CH2COMV_ADD</displayName>
                    <description>Channel 2 additional compare value register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH2COMVAL_ADD</name>
                            <description>Additional compare value of channel 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3COMV_ADD</name>
                    <displayName>CH3COMV_ADD</displayName>
                    <description>Channel 3 additional compare value register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>CH3COMVAL_ADD</name>
                            <description>Additional compare value of channel 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
