RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIMER50">
            <name>TIMER51</name>
            <groupName>TIMER</groupName>
            <baseAddress>0x4000F400</baseAddress>
            <interrupt>
                <name>TIMER51</name>
                <value>171</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>TMU</name>
            <description>Trigonometric Math Unit</description>
            <groupName>TMU</groupName>
            <baseAddress>0x48024400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMU_GLOBAL</name>
                <value>154</value>
            </interrupt>
            <registers>
                <register>
                    <name>CS</name>
                    <displayName>CS</displayName>
                    <description>Control and status register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000050</resetValue>
                    <fields>
                        <field>
                            <name>ENDF</name>
                            <description>End of TMU operation flag</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IWIDTH</name>
                            <description>Width of input data</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OWIDTH</name>
                            <description>Width of output data</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INUM</name>
                            <description>The number of times that the IDATA needs to be written</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ONUM</name>
                            <description>The number of times that the ODATA needs to be read</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDEN</name>
                            <description>Enable DMA request to write IDATA</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RDEN</name>
                            <description>Enable DMA request to read ODATA</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Enable interrupt request to read ODATA</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FACTOR</name>
                            <description>Scaling factor</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITRTNUM</name>
                            <description>Number of iterations</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>Mode of CORDIC operation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDATA</name>
                    <displayName>IDATA</displayName>
                    <description>Input data register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IDATA</name>
                            <description>The input data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ODATA</name>
                    <displayName>ODATA</displayName>
                    <description>Output Data register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ODATA</name>
                            <description>The output data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
