RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>DOEP3INTF</name>
                    <displayName>DOEP3INTF</displayName>
                    <description>
                        device out endpoint-3 interrupt flag
                        register
                    </description>
                    <addressOffset>0x368</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NYET</name>
                            <description>NYET handshake is sent</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTP</name>
                            <description>Back-to-back SETUP packets</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVR</name>
                            <description>Endpoint Rx FIFO overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPF</name>
                            <description>Setup phase finished</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP4INTF</name>
                    <displayName>DOEP4INTF</displayName>
                    <description>
                        device out endpoint-4 interrupt flag
                        register
                    </description>
                    <addressOffset>0x388</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NYET</name>
                            <description>NYET handshake is sent</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTP</name>
                            <description>Back-to-back SETUP packets</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVR</name>
                            <description>Endpoint Rx FIFO overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPF</name>
                            <description>Setup phase finished</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP5INTF</name>
                    <displayName>DOEP5INTF</displayName>
                    <description>
                        device out endpoint-5 interrupt flag
                        register
                    </description>
                    <addressOffset>0x3A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NYET</name>
                            <description>NYET handshake is sent</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTP</name>
                            <description>Back-to-back SETUP packets</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVR</name>
                            <description>Endpoint Rx FIFO overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPF</name>
                            <description>Setup phase finished</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP6INTF</name>
                    <displayName>DOEP6INTF</displayName>
                    <description>
                        device out endpoint-6 interrupt flag
                        register
                    </description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NYET</name>
                            <description>NYET handshake is sent</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTP</name>
                            <description>Back-to-back SETUP packets</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVR</name>
                            <description>Endpoint Rx FIFO overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPF</name>
                            <description>Setup phase finished</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP7INTF</name>
                    <displayName>DOEP7INTF</displayName>
                    <description>
                        device out endpoint-7 interrupt flag
                        register
                    </description>
                    <addressOffset>0x3E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NYET</name>
                            <description>NYET handshake is sent</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTP</name>
                            <description>Back-to-back SETUP packets</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVR</name>
                            <description>Endpoint Rx FIFO overrun</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPF</name>
                            <description>Setup phase finished</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP0LEN</name>
                    <displayName>DIEP0LEN</displayName>
                    <description>
                        device IN endpoint-0 transfer length
                        register
                    </description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP0LEN</name>
                    <displayName>DOEP0LEN</displayName>
                    <description>
                        device OUT endpoint-0 transfer length
                        register
                    </description>
                    <addressOffset>0x310</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP1LEN</name>
                    <displayName>DIEP1LEN</displayName>
                    <description>
                        device IN endpoint-1 transfer length
                        register
                    </description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP2LEN</name>
                    <displayName>DIEP2LEN</displayName>
                    <description>
                        device IN endpoint-2 transfer length
                        register
                    </description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP3LEN</name>
                    <displayName>DIEP3LEN</displayName>
                    <description>
                        device IN endpoint-3 transfer length
                        register
                    </description>
                    <addressOffset>0x170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP4LEN</name>
                    <displayName>DIEP4LEN</displayName>
                    <description>
                        device IN endpoint-4 transfer length
                        register
                    </description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP5LEN</name>
                    <displayName>DIEP5LEN</displayName>
                    <description>
                        device IN endpoint-5 transfer length
                        register
                    </description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP6LEN</name>
                    <displayName>DIEP6LEN</displayName>
                    <description>
                        device IN endpoint-6 transfer length
                        register
                    </description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
