RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>DIEP7LEN</name>
                    <displayName>DIEP7LEN</displayName>
                    <description>
                        device IN endpoint-7 transfer length
                        register
                    </description>
                    <addressOffset>0x1F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCNT</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP1LEN</name>
                    <displayName>DOEP1LEN</displayName>
                    <description>
                        device OUT endpoint-1 transfer length
                        register
                    </description>
                    <addressOffset>0x330</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP2LEN</name>
                    <displayName>DOEP2LEN</displayName>
                    <description>
                        device OUT endpoint-2 transfer length
                        register
                    </description>
                    <addressOffset>0x350</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP3LEN</name>
                    <displayName>DOEP3LEN</displayName>
                    <description>
                        device OUT endpoint-3 transfer length
                        register
                    </description>
                    <addressOffset>0x370</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP4LEN</name>
                    <displayName>DOEP4LEN</displayName>
                    <description>
                        device OUT endpoint-4 transfer length
                        register
                    </description>
                    <addressOffset>0x390</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP5LEN</name>
                    <displayName>DOEP5LEN</displayName>
                    <description>
                        device OUT endpoint-5 transfer length
                        register
                    </description>
                    <addressOffset>0x3B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP6LEN</name>
                    <displayName>DOEP6LEN</displayName>
                    <description>
                        device OUT endpoint-6 transfer length
                        register
                    </description>
                    <addressOffset>0x3D0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP7LEN</name>
                    <displayName>DOEP7LEN</displayName>
                    <description>
                        device OUT endpoint-7 transfer length
                        register
                    </description>
                    <addressOffset>0x3F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STPCNT_RXDPID</name>
                            <description>SETUP packet count/Received data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP0DMAADDR</name>
                    <displayName>DIEP0DMAADDR</displayName>
                    <description>Device IN endpoint 0 DMA address register</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP1DMAADDR</name>
                    <displayName>DIEP1DMAADDR</displayName>
                    <description>Device IN endpoint 1 DMA address register</description>
                    <addressOffset>0x134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP2DMAADDR</name>
                    <displayName>DIEP2DMAADDR</displayName>
                    <description>Device IN endpoint 2 DMA address register</description>
                    <addressOffset>0x154</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP3DMAADDR</name>
                    <displayName>DIEP3DMAADDR</displayName>
                    <description>Device IN endpoint 3 DMA address register</description>
                    <addressOffset>0x174</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP4DMAADDR</name>
                    <displayName>DIEP4DMAADDR</displayName>
                    <description>Device IN endpoint 4 DMA address register</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP5DMAADDR</name>
                    <displayName>DIEP5DMAADDR</displayName>
                    <description>Device IN endpoint 5 DMA address register</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP6DMAADDR</name>
                    <displayName>DIEP6DMAADDR</displayName>
                    <description>Device IN endpoint 6 DMA address register</description>
                    <addressOffset>0x1D4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEP7DMAADDR</name>
                    <displayName>DIEP7DMAADDR</displayName>
                    <description>Device IN endpoint 7 DMA address register</description>
                    <addressOffset>0x1F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP0DMAADDR</name>
                    <displayName>DOEP0DMAADDR</displayName>
                    <description>Device OUT endpoint 0 DMA address register</description>
                    <addressOffset>0x314</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP1DMAADDR</name>
                    <displayName>DOEP1DMAADDR</displayName>
                    <description>Device OUT endpoint 1 DMA address register</description>
                    <addressOffset>0x334</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP2DMAADDR</name>
                    <displayName>DOEP2DMAADDR</displayName>
                    <description>Device OUT endpoint 2 DMA address register</description>
                    <addressOffset>0x354</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP3DMAADDR</name>
                    <displayName>DOEP3DMAADDR</displayName>
                    <description>Device OUT endpoint 3 DMA address register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP4DMAADDR</name>
                    <displayName>DOEP4DMAADDR</displayName>
                    <description>Device OUT endpoint 4 DMA address register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP5DMAADDR</name>
                    <displayName>DOEP5DMAADDR</displayName>
                    <description>Device OUT endpoint 5 DMA address register</description>
                    <addressOffset>0x3B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP6DMAADDR</name>
                    <displayName>DOEP6DMAADDR</displayName>
                    <description>Device OUT endpoint 6 DMA address register</description>
                    <addressOffset>0x3D4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
