RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>HCH3CTL</name>
                    <displayName>HCH3CTL</displayName>
                    <description>
                        host channel-3 characteristics
                        register (HCH3CTL)
                    </description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH4CTL</name>
                    <displayName>HCH4CTL</displayName>
                    <description>
                        host channel-4 characteristics
                        register (HCH4CTL)
                    </description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH5CTL</name>
                    <displayName>HCH5CTL</displayName>
                    <description>
                        host channel-5 characteristics
                        register (HCH5CTL)
                    </description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH6CTL</name>
                    <displayName>HCH6CTL</displayName>
                    <description>
                        host channel-6 characteristics
                        register (HCH6CTL)
                    </description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH7CTL</name>
                    <displayName>HCH7CTL</displayName>
                    <description>
                        host channel-7 characteristics
                        register (HCH7CTL)
                    </description>
                    <addressOffset>0x1E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH8CTL</name>
                    <displayName>HCH8CTL</displayName>
                    <description>
                        host channel-8 characteristics
                        register (HCH8CTL)
                    </description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
