RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>HCH15CTL</name>
                    <displayName>HCH15CTL</displayName>
                    <description>
                        host channel-15 characteristics
                        register (HCH15CTL)
                    </description>
                    <addressOffset>0x2E0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MPL</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EPDIR</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSD</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MPC</name>
                            <description>Multiple Packet Count</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDFRM</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDIS</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH0STCTL</name>
                    <displayName>HCH0STCTL</displayName>
                    <description>host channel-0 split transaction control register
          (HCH0STCTL)</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH1STCTL</name>
                    <displayName>HCH1STCTL</displayName>
                    <description>host channel-1 split transaction control register
          (HCH1STCTL)</description>
                    <addressOffset>0x124</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH2STCTL</name>
                    <displayName>HCH2STCTL</displayName>
                    <description>host channel-2 split transaction control register
          (HCH2STCTL)</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH3STCTL</name>
                    <displayName>HCH3STCTL</displayName>
                    <description>host channel-3 split transaction control register
          (HCH3STCTL)</description>
                    <addressOffset>0x164</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH4STCTL</name>
                    <displayName>HCH4STCTL</displayName>
                    <description>host channel-4 split transaction control register
          (HCH4STCTL)</description>
                    <addressOffset>0x184</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH5STCTL</name>
                    <displayName>HCH5STCTL</displayName>
                    <description>host channel-5 split transaction control register
          (HCH5STCTL)</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH6STCTL</name>
                    <displayName>HCH6STCTL</displayName>
                    <description>host channel-6 split transaction control register
          (HCH6STCTL)</description>
                    <addressOffset>0x1C4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH7STCTL</name>
                    <displayName>HCH7STCTL</displayName>
                    <description>host channel-7 split transaction control register
          (HCH7STCTL)</description>
                    <addressOffset>0x1E4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH8STCTL</name>
                    <displayName>HCH8STCTL</displayName>
                    <description>host channel-8 split transaction control register
          (HCH8STCTL)</description>
                    <addressOffset>0x204</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH9STCTL</name>
                    <displayName>HCH9STCTL</displayName>
                    <description>host channel-9 split transaction control register
          (HCH9STCTL)</description>
                    <addressOffset>0x224</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Port address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>HADDR</name>
                            <description>HUB address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ISOPCE</name>
                            <description>Isochronous OUT payload continuation encoding</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CSPLT</name>
                            <description>Complete split enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPLEN</name>
                            <description> Enable high speed split transaction</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
