RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>HCH12INTF</name>
                    <displayName>HCH12INTF</displayName>
                    <description>
                        host channel-12 interrupt register
                        (HCH12INTF)
                    </description>
                    <addressOffset>0x288</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH13INTF</name>
                    <displayName>HCH13INTF</displayName>
                    <description>
                        host channel-13 interrupt register
                        (HCH13INTF)
                    </description>
                    <addressOffset>0x2A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH14INTF</name>
                    <displayName>HCH14INTF</displayName>
                    <description>
                        host channel-14 interrupt register
                        (HCH14INTF)
                    </description>
                    <addressOffset>0x2C8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH15INTF</name>
                    <displayName>HCH15INTF</displayName>
                    <description>
                        host channel-15 interrupt register
                        (HCH15INTF)
                    </description>
                    <addressOffset>0x2E8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TF</name>
                            <description>Transfer finished</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH</name>
                            <description>Channel halted</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAER</name>
                            <description>DMA Error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>
                                STALL response received
                                interrupt
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAK</name>
                            <description>
                                NAK response received
                                interrupt
                            </description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>
                                ACK response received/transmitted
                                interrupt
                            </description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBER</name>
                            <description>USB bus error</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBER</name>
                            <description>Babble error</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVR</name>
                            <description>Request queue overrun</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTER</name>
                            <description>Data toggle error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH0INTEN</name>
                    <displayName>HCH0INTEN</displayName>
                    <description>
                        host channel-0 interrupt enable register
                        (HCH0INTEN)
                    </description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFIE</name>
                            <description>Transfer completed interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHIE</name>
                            <description>Channel halted interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAERIE</name>
                            <description>DMA Error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALLIE</name>
                            <description>STALL interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAKIE</name>
                            <description>NAK interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKIE</name>
                            <description>ACK interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYETIE</name>
                            <description>NYET interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBERIE</name>
                            <description>USB bus error interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBERIE</name>
                            <description>Babble error interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVRIE</name>
                            <description>request queue overrun interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTERIE</name>
                            <description>Data toggle error interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH1INTEN</name>
                    <displayName>HCH1INTEN</displayName>
                    <description>
                        host channel-1 interrupt enable register
                        (HCH1INTEN)
                    </description>
                    <addressOffset>0x12C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFIE</name>
                            <description>Transfer completed interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHIE</name>
                            <description>Channel halted interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAERIE</name>
                            <description>DMA Error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALLIE</name>
                            <description>STALL interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAKIE</name>
                            <description>NAK interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKIE</name>
                            <description>ACK interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYETIE</name>
                            <description>NYET interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBERIE</name>
                            <description>USB bus error interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBERIE</name>
                            <description>Babble error interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVRIE</name>
                            <description>request queue overrun interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTERIE</name>
                            <description>Data toggle error interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
