RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>HCH14INTEN</name>
                    <displayName>HCH14INTEN</displayName>
                    <description>
                        host channel-14 interrupt enable register
                        (HCH14INTEN)
                    </description>
                    <addressOffset>0x2CC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFIE</name>
                            <description>Transfer completed interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHIE</name>
                            <description>Channel halted interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAERIE</name>
                            <description>DMA Error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALLIE</name>
                            <description>STALL interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAKIE</name>
                            <description>NAK interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKIE</name>
                            <description>ACK interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYETIE</name>
                            <description>NYET interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBERIE</name>
                            <description>USB bus error interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBERIE</name>
                            <description>Babble error interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVRIE</name>
                            <description>request queue overrun interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTERIE</name>
                            <description>Data toggle error interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH15INTEN</name>
                    <displayName>HCH15INTEN</displayName>
                    <description>
                        host channel-15 interrupt enable register
                        (HCH15INTEN)
                    </description>
                    <addressOffset>0x2EC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFIE</name>
                            <description>Transfer completed interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHIE</name>
                            <description>Channel halted interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAERIE</name>
                            <description>DMA Error interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STALLIE</name>
                            <description>STALL interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAKIE</name>
                            <description>NAK interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACKIE</name>
                            <description>ACK interrupt enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYETIE</name>
                            <description>NYET interrupt enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USBERIE</name>
                            <description>USB bus error interrupt enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BBERIE</name>
                            <description>Babble error interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REQOVRIE</name>
                            <description>request queue overrun interrupt enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTERIE</name>
                            <description>Data toggle error interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH0LEN</name>
                    <displayName>HCH0LEN</displayName>
                    <description>
                        host channel-0 transfer length
                        register
                    </description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH1LEN</name>
                    <displayName>HCH1LEN</displayName>
                    <description>
                        host channel-1 transfer length
                        register
                    </description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH2LEN</name>
                    <displayName>HCH2LEN</displayName>
                    <description>
                        host channel-2 transfer length
                        register
                    </description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH3LEN</name>
                    <displayName>HCH3LEN</displayName>
                    <description>
                        host channel-3 transfer length
                        register
                    </description>
                    <addressOffset>0x170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH4LEN</name>
                    <displayName>HCH4LEN</displayName>
                    <description>
                        host channel-4 transfer length
                        register
                    </description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH5LEN</name>
                    <displayName>HCH5LEN</displayName>
                    <description>
                        host channel-5 transfer length
                        register
                    </description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH6LEN</name>
                    <displayName>HCH6LEN</displayName>
                    <description>
                        host channel-6 transfer length
                        register
                    </description>
                    <addressOffset>0x1D0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH7LEN</name>
                    <displayName>HCH7LEN</displayName>
                    <description>
                        host channel-7 transfer length
                        register
                    </description>
                    <addressOffset>0x1F0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH8LEN</name>
                    <displayName>HCH8LEN</displayName>
                    <description>
                        host channel-8 transfer length
                        register
                    </description>
                    <addressOffset>0x210</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLEN</name>
                            <description>Transfer length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>DPID</name>
                            <description>Data PID</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PING</name>
                            <description>PING token request</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
