RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>HCH15DMAADDR</name>
                    <displayName>HCH15DMAADDR</displayName>
                    <description>Host channel 15 DMA address register</description>
                    <addressOffset>0x2F4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>USBHS1_DEVICE</name>
            <description>USB on the go high speed device</description>
            <groupName>USBHS1</groupName>
            <baseAddress>0x40080800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>DCFG</name>
                    <displayName>DCFG</displayName>
                    <description>
                        device configuration register
                        (DCFG)
                    </description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DS</name>
                            <description>Device speed</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>NZLSOH</name>
                            <description>
                                Non-zero-length status OUT
                                handshake
                            </description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAR</name>
                            <description>Device address</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EOPFT</name>
                            <description>end of periodic frame time</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCTL</name>
                    <displayName>DCTL</displayName>
                    <description>
                        device control register
                        (DCTL)
                    </description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RWKUP</name>
                            <description>Remote wakeup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD</name>
                            <description>Soft disconnect</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GINS</name>
                            <description>Global IN NAK status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>GONS</name>
                            <description>Global OUT NAK status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DTEST</name>
                            <description>Device Test control</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SGINAK</name>
                            <description>Set global IN NAK</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CGINAK</name>
                            <description>Clear global IN NAK</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SGONAK</name>
                            <description>Set global OUT NAK</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CGONAK</name>
                            <description>Clear global OUT NAK</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POIF</name>
                            <description>Power-on initialization flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>L1RJCT</name>
                            <description>Deep sleep reject</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DSTAT</name>
                    <displayName>DSTAT</displayName>
                    <description>
                        device status register
                        (DSTAT)
                    </description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPST</name>
                            <description>Suspend status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ES</name>
                            <description>Enumerated speed</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FNRSOF</name>
                            <description>
                                Frame number of the received
                                SOF
                            </description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPINTEN</name>
                    <displayName>DIEPINTEN</displayName>
                    <description>
                        device IN endpoint common interrupt
                        mask register (DIEPINTEN)
                    </description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFEN</name>
                            <description>
                                Transfer finished interrupt
                                enable
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDISEN</name>
                            <description>
                                Endpoint disabled interrupt
                                enable
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CITOEN</name>
                            <description>
                                Control IN timeout condition interrupt enable (Non-isochronous
                                endpoints)
                            </description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTXFUDEN</name>
                            <description>Endpoint Tx FIFO underrun interrupt enable bit</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IEPNEEN</name>
                            <description>
                                IN endpoint NAK effective
                                interrupt enable
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NAKEN</name>
                            <description>NAK handshake sent by USBHS interrupt enable bit</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINTEN</name>
                    <displayName>DOEPINTEN</displayName>
                    <description>
                        device OUT endpoint common interrupt
                        enable register (DOEPINTEN)
                    </description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TFEN</name>
                            <description>
                                Transfer finished interrupt
                                enable
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDISEN</name>
                            <description>
                                Endpoint disabled interrupt
                                enable
                            </description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPFEN</name>
                            <description>SETUP phase finished interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPRXFOVREN</name>
                            <description>Endpoint Rx FIFO overrun interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BTBSTPEN</name>
                            <description>
                                Back-to-back SETUP packets
                                interrupt enable
                            </description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYETEN</name>
                            <description>Send NYET handshake interrupt enable bit</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAEPINT</name>
                    <displayName>DAEPINT</displayName>
                    <description>
                        device all endpoints interrupt
                        register (DAEPINT)
                    </description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IEPITB</name>
                            <description>Device all IN endpoint interrupt bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>OEPITB</name>
                            <description>Device all OUT endpoint interrupt bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DAEPINTEN</name>
                    <displayName>DAEPINTEN</displayName>
                    <description>
                        Device all endpoints interrupt enable register
                        (DAEPINTEN)
                    </description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IEPIE</name>
                            <description>IN EP interrupt interrupt enable bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>OEPIE</name>
                            <description>OUT endpoint interrupt enable bits</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DVBUSDT</name>
                    <displayName>DVBUSDT</displayName>
                    <description>
                        device VBUS discharge time
                        register
                    </description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000017D7</resetValue>
                    <fields>
                        <field>
                            <name>DVBUSDT</name>
                            <description>Device VBUS discharge time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DVBUSPT</name>
                    <displayName>DVBUSPT</displayName>
                    <description>
                        device VBUS pulsing time
                        register
                    </description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000005B8</resetValue>
                    <fields>
                        <field>
                            <name>DVBUSPT</name>
                            <description>Device VBUS pulsing time</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPFEINTEN</name>
                    <displayName>DIEPFEINTEN</displayName>
                    <description>
                        device IN endpoint FIFO empty
                        interrupt enable register
                    </description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IEPTXFEIE</name>
                            <description>
                                IN EP Tx FIFO empty interrupt enable
                                bits
                            </description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEP1INT</name>
                    <displayName>DEP1INT</displayName>
                    <description>Device endpoint 1 interrupt register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IEP1INT</name>
                            <description>IN Endpoint 1 interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OEP1INT</name>
                            <description>OUT Endpoint 1 interrupt</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DEP1INTEN</name>
                    <displayName>DEP1INTEN</displayName>
                    <description>Device endpoint 1 interrupt register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IEP1INTEN</name>
                            <description>IN Endpoint 1 interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OEP1INTEN</name>
                            <description>OUT Endpoint 1 interrupt enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
