RT-Thread-Studio/sdk-csp-gd32h7/debug/svd/GD32H75E.svd
                <register>
                    <name>DOEP1CTL</name>
                    <displayName>DOEP1CTL</displayName>
                    <description>
                        device endpoint-1 control
                        register
                    </description>
                    <addressOffset>0x320</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPD</name>
                            <description>Endpoint disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID_SODDFRM</name>
                            <description>SD1PID/SODDFRM</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVENFRM</name>
                            <description>SD0PID/SEVENFRM</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>Set NAK</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>Clear NAK</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>STALL handshake</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNOOP</name>
                            <description>Snoop mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKS</name>
                            <description>NAK status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOFRM_DPID</name>
                            <description>EOFRM/DPID</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPACT</name>
                            <description>Endpoint active</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPL</name>
                            <description>maximum packet length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP2CTL</name>
                    <displayName>DOEP2CTL</displayName>
                    <description>
                        device endpoint-2 control
                        register
                    </description>
                    <addressOffset>0x340</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPD</name>
                            <description>Endpoint disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID_SODDFRM</name>
                            <description>SD1PID/SODDFRM</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVENFRM</name>
                            <description>SD0PID/SEVENFRM</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>Set NAK</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>Clear NAK</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>STALL handshake</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNOOP</name>
                            <description>Snoop mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKS</name>
                            <description>NAK status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOFRM_DPID</name>
                            <description>EOFRM/DPID</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPACT</name>
                            <description>Endpoint active</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPL</name>
                            <description>maximum packet length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP3CTL</name>
                    <displayName>DOEP3CTL</displayName>
                    <description>
                        device endpoint-3 control
                        register
                    </description>
                    <addressOffset>0x360</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPD</name>
                            <description>Endpoint disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID_SODDFRM</name>
                            <description>SD1PID/SODDFRM</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVENFRM</name>
                            <description>SD0PID/SEVENFRM</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>Set NAK</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>Clear NAK</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>STALL handshake</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNOOP</name>
                            <description>Snoop mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKS</name>
                            <description>NAK status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOFRM_DPID</name>
                            <description>EOFRM/DPID</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPACT</name>
                            <description>Endpoint active</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPL</name>
                            <description>maximum packet length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEP4CTL</name>
                    <displayName>DOEP4CTL</displayName>
                    <description>
                        device endpoint-4 control
                        register
                    </description>
                    <addressOffset>0x380</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPD</name>
                            <description>Endpoint disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SD1PID_SODDFRM</name>
                            <description>SD1PID/SODDFRM</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SD0PID_SEVENFRM</name>
                            <description>SD0PID/SEVENFRM</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SNAK</name>
                            <description>Set NAK</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CNAK</name>
                            <description>Clear NAK</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>STALL</name>
                            <description>STALL handshake</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SNOOP</name>
                            <description>Snoop mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKS</name>
                            <description>NAK status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOFRM_DPID</name>
                            <description>EOFRM/DPID</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPACT</name>
                            <description>Endpoint active</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MPL</name>
                            <description>maximum packet length</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
